from config import TOKEN 
import logging
from aiogram import Bot, Dispatcher, executor, types
from button import *
from aiogram.dispatcher.filters.state import State, StatesGroup
from aiogram.dispatcher import FSMContext
from aiogram.contrib.fsm_storage.memory import MemoryStorage


logging.basicConfig(level=logging.INFO)

bot = Bot(token=TOKEN)
dp = Dispatcher(bot, storage=MemoryStorage())


class Qidiruv_bot(StatesGroup):
    text_bot = State()






@dp.message_handler(commands=['start', 'help'])
async def send_welcome(message: types.Message):
    await message.answer("""<b>"O'zbekiston temir yo'llari" aksiyadorlik jamiyati miqyosidagi barcha tarkibiy bo'linmalarning xizmat telefon raqamlarining qidiruv tizimi.</b>""" , parse_mode = 'HTML',reply_markup = bosh_sahifa)

@dp.message_handler(text="📝 Malumotlar")
async def bosh_sahifa_bot(message: types.Message):
    await message.answer("""<b>"Qarshi mintaqaviy temir yo'l uzeli" UK</b>""" ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_uzel)

@dp.message_handler(text=""""Qarshi mintaqaviy temir yo'l uzeli" UK""")
async def bosh_sahifa_qarshi_uzel_bot(message: types.Message):
    await message.answer("<b>Менюдан бирортасини танланг</b>" ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_0)

@dp.message_handler(text="МТУ бўлимлар")
async def mtu_bulimlar(message: types.Message):
    await message.answer("""<b>МТУ бўлимлар</b>""" ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Корхоналар")
async def korxonalar(message: types.Message):
    await message.answer("""<b>Корхоналар</b>""" ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_2)


@dp.message_handler(text="Худудий бўлинмалар")
async def xududiy_bulinmalar(message: types.Message):
    await message.answer("""<b>Худудий бўлинмалар</b>""" ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)


@dp.message_handler(text="Станциялар")
async def stansiyalar(message: types.Message):
    await message.answer("""<b>"Станциялар</b>""" ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_4)



@dp.message_handler(text="⏹ Бош саҳифа")
async def bosh_sahifaga_qaytish(message: types.Message):
    await message.answer("""<b>"O'zbekiston temir yo'llari" aksiyadorlik jamiyati miqyosidagi barcha tarkibiy bo'linmalarning xizmat telefon raqamlarining qidiruv tizimi.</b>""" , parse_mode = 'HTML',reply_markup = bosh_sahifa)

@dp.message_handler(text="⬅️ orqaga")
async def bosh_sahifaga_orqaga(message: types.Message):
    await message.answer("<b>Менюдан бирортасини танланг</b>" ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_0)


@dp.message_handler(text="МТУ-5 бошлиғи , бош муҳандис ва ёрдамчилари")
async def bolim_1(message: types.Message):
    text = """<b>
🔹 МТУ-5 бошлиғи , бош муҳандис ва ёрдамчилари\n\n
🔰 “Қарши МТУ” УК бошлиғи	
☎️ Telefon nomeri: 55-000

🔰 Қабулхона	
☎️ Telefon nomeri: 55-027

🔰 Факс 	
☎️ Telefon nomeri: 55-329

🔰 Котибият бўлим бошлиғи	
☎️ Telefon nomeri: 55-004

🔰 МТУ-5 хавфсизлик бўйича ёрдамчиси	
☎️ Telefon nomeri: 55-386

🔰 МТУ бош муҳандиси	
☎️ Telefon nomeri: 55-001

🔰 МТУ бош муҳандис ўринбосари	
☎️ Telefon nomeri: 55-008

🔰 МТУ бошлиқ ўринбосари	
☎️ Telefon nomeri: 55-002

🔰 МТУ бош муҳандиси ва МТУ бошлиқ ўринбосари қабулхонаси	
☎️ Telefon nomeri: 55-389

🔰 МТУ бошлиқ ўринбосарининг тезкор ишлар бўйича ёрдамчиси	
☎️ Telefon nomeri: 55-005

🔰 МТУ бошлиқ ўринбосарининг техник ишлар бўйича ёрдамчиси	
☎️ Telefon nomeri: 55-302

🔰 МТУ бошлиқ ўринбосарининг техника хавфсизлиги бўйича муҳандиси	
☎️ Telefon nomeri: 55-390 
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Ходимлар ва ижтимоий масалалар бўлими")
async def bolim_2(message: types.Message):
    text = """<b>
🔹 Ходимлар ва ижтимоий масалалар бўлими\n\n
🔰 Бошлиқ 	
☎️Telefon nomeri: 55-003

🔰 Бошлиқ ўринбосари 	
☎️ 55-328

🔰 Ходимлар ва ижтимоий масалалар бўлими етакчи муҳандиси	
☎️ 55-311

🔰 Ходимлар ва ижтимоий масалалар бўлими катта нозири	
☎️ 55-353
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="МТУ-5 навбатчи бўлими (ДНЦО)")
async def bolim_3(message: types.Message):
    text = """<b>
🔹 МТУ-5 навбатчи бўлими (ДНЦО)\n\n
🔰 Катта навбатчиси	
☎️ Телефон номери: 55-304

🔰 Навбатчи 	
☎️ Телефон номери: 55-029

🔰 Тошғузор-Оқрабод т.й.ў. бўйича навбатчи	
☎️ Телефон номери: 55-026

🔰 Ҳуқуқшунос	
☎️ Телефон номери: 55-306
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Статистика ва ҳисобот бўлими")
async def bolim_4(message: types.Message):
    text = """<b>
🔹 Статистика ва ҳисобот бўлими\n\n
🔰 Бошлиқ 	
☎️ Телефон номери: 55-062

🔰 Иқтисодчи 	
☎️ 55-355

🔰 Операторлари 	
☎️ Телефон номери: 55-375

🔰 Автоматика бошқарув тизимлари муҳандиси	
☎️ Телефон номери: 55-090

🔰 Автоматика бошқариш тизимлари оператори	
☎️ Телефон номери: 55-318

🔰 Автоматика бошқариш тизимлари ФАКС	
☎️ Телефон номери: 55-343
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Молия бўлими")
async def bolim_5(message: types.Message):
    text = """<b>
🔹 Молия бўлими\n\n
🔰 Бошлиқ	
☎️ 55-006

🔰 Бошлиқ ўринбосари	
☎️ 55-371

🔰 Оператор	
☎️ 55-335

🔰 Молия бўлими	
☎️ 55-321
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Ҳисобчилар бўлими")
async def bolim_6(message: types.Message):
    text = """<b>
🔹 Ҳисобчилар бўлими\n\n
🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-020

🔰 Ҳисоб-китоб бўйича ҳисобчи	
☎️ Телефон номери: 55-352

🔰 Материаллар бўйича ҳисобчи	
☎️ Телефон номери: 55-346

🔰 Ҳисобчи	
☎️ Телефон номери: 55-332

🔰 Ҳисобчи	
☎️ Телефон номери: 55-356
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Иқтисодий таҳлил ва прогнозлаш бўлими")
async def bolim_7(message: types.Message):
    text = """<b>
🔹 Иқтисодий таҳлил ва прогнозлаш бўлими\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-007

🔰 Ҳажм, сифат ва бошқа кўрсаткичлар бўйича етакчи муҳандиси	
☎️ Телефон номери: 55-331

🔰 Ҳаражатлар бўйича етакчи иқтисодчи	
☎️ Телефон номери: 55-378

🔰 Меҳнатга ҳақ тўлаш бўйича етакчи муҳандиси	
☎️ Телефон номери: 55-334

🔰 Иқтисодчи бўлими	
☎️ Телефон номери: 55-379
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Ҳаридлар бўлими")
async def bolim_8(message: types.Message):
    text = """<b>
🔹 Ҳаридлар бўлими\n\n
🔰 Бошлиқ 	
☎️ Телефон номери: 55-880

🔰 Муҳандис	
☎️ Телефон номери: 55-497

🔰 Нозир	
☎️ Телефон номери: 55-096
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Махсус бўлим")
async def bolim_9(message: types.Message):
    text = """<b>
🔹 Махсус бўлим\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-055

🔰 Муҳандис	
☎️ Телефон номери: 55-309

🔰 Нозир	
☎️ Телефон номери: 55-324

🔰 Фуқаро муҳофаза муҳандиси	
☎️ Телефон номери: 55-327
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="АКТ ва АХ бўлими")
async def bolim_10(message: types.Message):
    text = """<b>
🔹 АКТ ва АХ бўлими\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-095

🔰 Муҳандис	
☎️ Телефон номери: 55-291

</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Капитал қурилиш бўлими")
async def bolim_11(message: types.Message):
    text = """<b>
🔹 Капитал қурилиш бўлими\n\n
🔰 Бошлиқ 	
☎️ Телефон номери: 55-050

🔰 Етакчи муҳандиси 	
☎️ Телефон номери: 55-342

🔰 Кадастр	
☎️ Телефон номери: 55-317
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Юк ва тижорат ишлари бўлими")
async def bolim_12(message: types.Message):
    text = """<b>
🔹 Юк ва тижорат ишлари бўлими\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-017

🔰 Шартномавий таъриф ҳисоблаш ва шахобча йўлларини эксплуатация қилиш бўйича муҳандис	
☎️ Телефон номери: 55-337

🔰 Катта нозир	
☎️ Телефон номери: 55-354

🔰 Юк ташишни режалаштириш муҳандиси	
☎️ Телефон номери: 55-307

🔰 Юк ташиш шартлари бўйича муҳандиси	
☎️ Телефон номери: 55-338

🔰 Етакчи муҳандис	
☎️ Телефон номери: 55-067
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Технологик ҳужжатларни қайта ишлаш маркази 'Тех ПД-5'")
async def bolim_13(message: types.Message):
    text = """<b>
🔹 Технологик ҳужжатларни қайта ишлаш маркази "Тех ПД-5"\n\n
🔰 "Тех ПД-5"  бошлиғи	
☎️ Телефон номери: 55-011

🔰 Бошлиқ ўринбосари	
☎️ Телефон номери: 55-486

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-489

Ҳисобчилар бўлими	
☎️ Телефон номери: 55-483

🔰 Муҳандис оператор	
☎️ Телефон номери: 55-484

🔰 Юк хужжатлари ҳисобчиси	
☎️ Телефон номери: 55-485

🔰 Ҳуқуқшунос	
☎️ Телефон номери: 55-487

🔰 Даромадлар бўйича нозирлар	
☎️ Телефон номери: 55-388
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="“Қарши МТУ” УК 'Ўзгосжеллдорнадзор' ҳудудий инспектсияси")
async def bolim_14(message: types.Message):
    text = """<b>
🔹 “Қарши МТУ” УК "Ўзгосжеллдорнадзор" ҳудудий инспектсияси\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-009

🔰 Қабулхона	
☎️ Телефон номери: 55-315

🔰 Умумий бўлим	
☎️ Телефон номери: 55-316

🔰 Умумий бўлим	
☎️ Телефон номери: 55-312

🔰 Умумий бўлим	
☎️ Телефон номери: 55-144

🔰 ФАКС	
☎️ Телефон номери: 227-11-23
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Техника ва техналогия назорат бошқармаси “Қарши МТУ” УК бўлими")
async def bolim_15(message: types.Message):
    text = """<b>
🔹 Техника ва техналогия назорат бошқармаси “Қарши МТУ” УК бўлими\n\n
🔰 ТТНБ “Қарши МТУ” УК бўйича бош нозир	
☎️ Телефон номери: 55-016

🔰 Аloқа ва СЦБ хўжалиги бўйича нозир	
☎️ Телефон номери: 55-032

🔰 Йўл хужалиги бўйича нозир	
☎️ Телефон номери: 55-310

🔰 Ташишларни ташкил этиш бўйича нозир	
☎️ Телефон номери: 55-322

🔰 Локомотив хўжалиги бўйича нозир	
☎️ Телефон номери: 55-391

🔰 Электр таъминоти хўжалиги бўйича нозир	
☎️ Телефон номери: 55-325

🔰 Вагон хўжалиги бўйича нозир	
☎️ Телефон номери: 58-750
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Техник ишлаб чиқариш бўлими")
async def bolim_16(message: types.Message):
    text = """<b>
🔹 Техник ишлаб чиқариш бўлими\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-008

🔰 ФАКС	
☎️ Телефон номери: 55-383
☎️ Телефон номери: 75-227-23-44

🔰 Йўл хўжалиги бўйича бўлим бошлиғи	
☎️ Телефон номери: 55-039

🔰 Алоқа, СЦБ ва электр таъминоти етакчи муҳандиси	
☎️ Телефон номери: 55-013

🔰 Электр таъминоти бўйича етакчи муҳандиси	
☎️ Телефон номери: 55-075

🔰 Вагон хўжалиги етакчи мухандиси	
☎️ Телефон номери: 55-380

🔰 Локомотив хўжалиги етакчи мухандиси	
☎️ Телефон номери: 55-313

🔰 Вагонлар сақланиши бўйича етакчи мухандиси	
☎️ Телефон номери: 55-399

🔰 Ёқилғи ва энергетика ресурслари етакчи муҳандиси 	
☎️ Телефон номери: 55-025

🔰 Автотранспорт воситалари бўйича етакчи муҳандиси 	
🔰 Факс 
☎️ Телефон номери: 55-341

🔰 Метролог	
☎️ Телефон номери: 55-397
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)

@dp.message_handler(text="Қарши алоқа ва ишорат муассасаси ШЧ-8")
async def bolim_17(message: types.Message):
    text = """<b>
🔹 Қарши алоқа ва ишорат муассасаси ШЧ-8\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-040

🔰 Бош муҳандис	
☎️ Телефон номери: 55-041

🔰 Қабулхона	
☎️ Телефон номери: 55-240

🔰 СЦБ бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 55-042

🔰 Алоқа бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 55-043

🔰 Ҳодимлар бўлими	
☎️ Телефон номери: 55-037

🔰 Ҳодимлар бўлими нозири	
☎️ Телефон номери: 55-288

🔰 Техник хужжатлар бўлими	
☎️ Телефон номери: 55-021
   55-456
🔰 Техника бўлими	
☎️ Телефон номери: 55-237
  55-044
🔰 Касаба уюшмаси кўмитаси	
☎️ Телефон номери: 55-033

🔰 Меҳнат мухофазаси муҳандиси	
☎️ Телефон номери: 55-061

🔰 Ҳодимлар тайёрлаш муҳандиси	
☎️ Телефон номери: 55-072

🔰 Иқтисодчи	
☎️ Телефон номери: 55-046

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-071

🔰 Материаллар ҳисобчиси	
☎️ Телефон номери: 55-251

🔰 Ойлик маош ҳисобчиси	
☎️ Телефон номери: 55-224

🔰 Маркетинг бўлими	
☎️ Телефон номери: 55-755

🔰 Касса	
☎️ Телефон номери: 55-209

🔰 Катта диспетчер	
☎️ Телефон номери: 55-245

🔰 Диспетчер	
☎️ Телефон номери: 55-045
☎️ Телефон номери: 58-745
☎️ Телефон номери: 227-21-75

🔰 Ёшлар иттифоқи	
☎️ Телефон номери: 55-568

🔰 Телеграф	
☎️ Телефон номери: 55-289

🔰 ТТС цех бошлиғи	
☎️ Телефон номери: 55-210

🔰 АТС катта эл.механиги 	
☎️ Телефон номери: 55-064

🔰 АТС эл.механиклар хонаси	
☎️ Телефон номери: 56-049

🔰 АМК хонаси (Коммутатор) 	
☎️ Телефон номери: 58-771

🔰 АТС кросс	
☎️ Телефон номери: 55-049

🔰 ЛАЗ катта эл.механиги	
☎️ Телефон номери: 55-250

🔰 ЛАЗ навбатчи эл.механиги	
☎️ Телефон номери: 55-047,  58-747

🔰 ЛАЗ ертуласи	
☎️ Телефон номери: 55-230

🔰 ВОЛС эл.механиклари	
☎️ Телефон номери: 58-777

🔰 Видео кузатув цехи	
☎️ Телефон номери: 58-770

🔰 Ишонч группаси цехи	
☎️ Телефон номери: 55-232

🔰 КИП алоқа цехи 	
☎️ Телефон номери: 55-253

🔰 ДЦ эл.механиклари	
☎️ Телефон номери: 55-214

🔰 КИП СЦБ эл.механиклари	
☎️ Телефон номери: 55-249   55-261

🔰 КИП контактсиз аппаратлар	
☎️ Телефон номери: 55-256

🔰 КТСМ эл.механиклари	
🔰 Автотураргоҳ	
☎️ Телефон номери: 55-254

🔰 Омборхона	
☎️ Телефон номери: 55-276

🔰 Кабелчилар	
☎️ Телефон номери: 55-257

🔰 СЦБ кабелчилари	
☎️ Телефон номери: 55-241

🔰 Автомеханик	
☎️ Телефон номери: 55-238

🔰 МРЦ	
☎️ Телефон номери: 55-297

🔰 Алоқа МРЦ релека	
☎️ Телефон номери: 55-234

🔰 КРП	
☎️ Телефон номери: 56-797

🔰 АТС лок депо	
☎️ Телефон номери: 56-764

🔰 Назорат пункти	
☎️ Телефон номери: 55-260
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_1)



@dp.message_handler(text="Қарши электр таъминоти корхонаси (ЭЧ-5)")
async def bolim_18(message: types.Message):
    text = """<b>
🔹 Қарши электр таъминоти корхонаси (ЭЧ-5)\n\n
🔰 Корхона бошлиғи	
☎️ Телефон номери: 55-014

🔰 Бош муҳандис	
☎️ Телефон номери: 55-024

🔰 Контакт тармоғи бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 55-190

🔰 Тортув нимстанциялари бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 58-776

🔰 Қурилиш ишлари бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 55-213

🔰 Қабулхона	
☎️ Телефон номери: 55-227

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-142

🔰 Ҳисобчилар	
☎️ Телефон номери: 55-226

🔰 Техник жараёнларни бошқариш бўлими	
☎️ Телефон номери: 55-219   55-212;

🔰 Факс 
☎️ Телефон номери: 55-211

🔰 Иқтисодчи	
☎️ Телефон номери: 55-220

🔰 Техника хавфсизлиги муҳандиси	
☎️ Телефон номери: 55-141

🔰 Ходимлар бўлими	
☎️ Телефон номери: 55-145

🔰 Электр энергия ҳисоб бўлими	
☎️ Телефон номери: 55-208

🔰 Касаба уюшмаси қўмитаси	
☎️ Телефон номери: 55-522

🔰 Қаровулхона	
☎️ Телефон номери: 55-146

🔰 Энергодиспетчер	
☎️ Телефон номери: 55-216  55-217

75 227-16-18
🔰 ТЕТ-1	
☎️ Телефон номери: 55-235

🔰 Лаборатория	
☎️ Телефон номери: 55-218

🔰 27-сонли Айратом туман контакт тармоғи	
☎️ Телефон номери: 58-372  30-061

🔰 27-сонли Айратом тортув нимстанцияси	
☎️ Телефон номери: 58-270  58-371

🔰 28-сонли Қашқадарё туман контакт тармоғи	
☎️ Телефон номери: 30-062

🔰 28-сонли Қашқадарё тортув нимстанцияси	
☎️ Телефон номери: 58-280  58-046

🔰 29-сонли Тошғузор туман контакт тармоғи	
☎️ Телефон номери: 30-054  30-056

🔰 29-сонли Тошғузор тортув нимстанцияси	
☎️ Телефон номери: 30-050  30-052

🔰 30-сонли Яккабоғ туман контакт тармоғи	
☎️ Телефон номери: 95 682-80-21

🔰 31-сонли Дехқонобод туман контакт тармоғи	
☎️ Телефон номери: 30-163

🔰 31-сонли Дехқонобод тортув нимстанцияси	
☎️ Телефон номери: 30-162

🔰 32-сонли Оқрабод туман контакт тармоғи	
☎️ Телефон номери: 53-425 

95 325-25-95
🔰 32-сонли Оқрабод тортув нимстанцияси	
☎️ Телефон номери: 53-423  30-250 30-252

</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_2)

@dp.message_handler(text="Қарши темир йул таъмирлаш корхонаси (ПЧ-12)")
async def bolim_19(message: types.Message):
    text = """<b>
🔹 Қарши темир йул таъмирлаш корхонаси (ПЧ-12)\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-030

🔰 Бошлиқ қабулхонаси	
☎️ Телефон номери: 55-407

🔰 Бош муҳандис	
☎️ Телефон номери: 55-031

🔰 Ходимлар бўлими	
☎️ Телефон номери: 55-414

🔰 Иқтисодчи	
☎️ Телефон номери: 55-409

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-404

🔰 Ҳисобчилар бўлими	
☎️ Телефон номери: 55-405

🔰 Меҳнатни муҳоваза қилиш бўлими	
☎️ Телефон номери: 55-401

🔰 Техник ишлаб чиқариш бўлими	
☎️ Телефон номери: 55-406

🔰 Диспетчер	
☎️ Телефон номери: 55-410    55-233

🔰 Дефектоскоп операторлар хонаси 	
☎️ Телефон номери: 55-408

🔰 1-бўлинма Қарши бекати	
☎️ Телефон номери: 55-412

🔰 2-бўлинма Қарши бекати	
☎️ Телефон номери: 55-413

🔰 Мажлислар зали	
☎️ Телефон номери: 55-403

🔰 Назорат пункти	
☎️ Телефон номери: 55-400
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_2)

@dp.message_handler(text="Қашқадарё темир йул таъмирлаш корхонаси (ПЧ-14)")
async def bolim_20(message: types.Message):
    text = """<b>
🔹 Қашқадарё темир йул таъмирлаш корхонаси (ПЧ-14)\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-266

🔰 Бош муҳандис	
☎️ Телефон номери: 55-556

🔰 Техник ишлаб чиқариш бўлими	
☎️ Телефон номери: 55-244    55-275

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-642

🔰 Ҳисобчилар хонаси	
☎️ Телефон номери: 55-632

🔰 Иқтисодчи	
☎️ Телефон номери: 55-633

🔰 Ҳодимлар бўлими	
☎️ Телефон номери: 55-641

🔰 Меҳнат мухофазаси бўйича муҳандис	
☎️ Телефон номери: 55-635

🔰 Навбатчи	
☎️ Телефон номери: 55-631
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_2)

@dp.message_handler(text="Қарши вагон депоси (ВЧД-8)")
async def bolim_21(message: types.Message):
    text = """<b>
🔹 Қарши вагон депоси (ВЧД-8)\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-080,   56-201

🔰 Бош муҳандис 	
☎️ Телефон номери: 55-223,   56-202

🔰 Таъмир ишлари бўйича бошлиқ ўринбосари 	
☎️ Телефон номери: 55-139,   56-203

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-087,  56-204

🔰 Бошлиқ ёрдамчиси	
☎️ Телефон номери: 56-227

🔰 Иқтисод бўлими	
☎️ Телефон номери: 56-233

🔰 Хисобчилар хонаси	
☎️ Телефон номери: 56-229
☎️ Телефон номери: 56-230
☎️ Телефон номери: 56-231

🔰 Ҳуқуқшунос	
☎️ Телефон номери: 56-226

🔰 Ходимлар бўлими	
☎️ Телефон номери: 56-234,  56-235

🔰 АХЧ	
☎️ Телефон номери: 56-225

🔰 Маркетинг бўлими бошлиғи	
☎️ Телефон номери: 56-228

🔰 АКТ хонаси	
☎️ Телефон номери: 56-224

🔰 Тиббиёт хонаси	
☎️ Телефон номери: 56-241

🔰 Меҳнатга хақ тўлаш бўлими	
☎️ Телефон номери: 56-236

🔰 Маркетинг хонаси	
☎️ Телефон номери: 56-237

🔰 Техник ишлаб чиқариш бўлими	
☎️ Телефон номери: 56-238 56-239 56-240

🔰 Техник ишлаб чиқариш бўлими бошлиғи	
☎️ Телефон номери: 56-242

🔰 Диспетчер	
☎️ Телефон номери: 55-222,  56-232

🔰 Механика цехи хонаси	
☎️ Телефон номери: 56-243,  56-244

🔰 Омборхона	
☎️ Телефон номери: 56-245

🔰 Бош механик	
☎️ Телефон номери: 56-246

🔰 Қурилиш бўлими	
☎️ Телефон номери: 56-252,   56-255

🔰 Автомеханик	
☎️ Телефон номери: 56-247,   56-248

🔰 Касаба уюшмаси қўмитаси	
☎️ Телефон номери: 56-250

🔰 ПТО	
☎️ Телефон номери: 55-131  

🔰 Техник	
☎️ Телефон номери: 55-132

🔰 Вагонларга техник хизмат кўрсатиш шахобчаси бошлиғи	
☎️ Телефон номери: 55-133

🔰 Вагон оператори	
☎️ Телефон номери: 55-139
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_2)

@dp.message_handler(text="Қарши локомотив депоси (ТЧ-8)")
async def bolim_22(message: types.Message):
    text = """<b>
🔹 Қарши локомотив депоси (ТЧ-8)\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 56-755    55-495

🔰 Бош муҳандис	
☎️ Телефон номери: 56-757

🔰 Қабулхона	
☎️ Телефон номери: 56-776

🔰 Локомотив хўжалиги бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 56-767

🔰 Локомотивларни таъмирлаш бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 56-756

🔰 Навбатчи	
☎️ Телефон номери: 55-493    56-759

🔰 Ходимлар бўлими	
☎️ Телефон номери: 56-783

🔰 Бош ҳисобчи	
☎️ Телефон номери: 56-760

🔰 Материаллар бўйича ҳисобчи	
☎️ Телефон номери: 56-807

🔰 Ойлик маош ҳисобчиси
☎️ Телефон номери: 	56-806

🔰 Меҳнат муҳофазаси бўйича муҳандис	
☎️ Телефон номери: 56-784

🔰 Иқтисодчи	
☎️ Телефон номери: 56-781

🔰 Тезкор ҳисоблаш бўлими	
☎️ Телефон номери: 56-780

🔰 Локомотив ленталарини таҳлил қилиш бўлими	
☎️ Телефон номери: 56-792

🔰 Техник ишлар бўлими	
☎️ Телефон номери: 56-779

🔰 Тиббий назорат пункти	
☎️ Телефон номери: 56-799

🔰 Дам олиш уйи	
☎️ Телефон номери: 56-789

🔰 Назорат пункти	
☎️ Телефон номери: 56-791

🔰 Меҳнатга ҳақ тўлаш муҳандиси	
☎️ Телефон номери: 56-790

🔰 Электровоз цехи бошлиғи	
☎️ Телефон номери: 56-763

🔰 Электровоз цехи мастери	
☎️ Телефон номери: 56-844

🔰 Касаба уюшмаси қўмитаси	
☎️ Телефон номери: 56-808

🔰 КРП эл.механиклар хонаси	
☎️ Телефон номери: 56-797

🔰 АТС хонаси	
☎️ Телефон номери: 56-764

🔰 Қўриқлаш ходимлари	
☎️ Телефон номери: 56-875

🔰 3-назорат пункти	
☎️ Телефон номери: 56-876

🔰 Омборхона  (Зап. част)	
☎️ Телефон номери: 56-809

🔰 Омборхона  (матер част)	
☎️ Телефон номери: 56-810

🔰 Қозонхона	
☎️ Телефон номери: 56-787
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_2)

@dp.message_handler(text="Қарши қурилиш таъмирлаш корхонаси")
async def bolim_23(message: types.Message):
    text = """<b>
🔹 Қарши қурилиш таъмирлаш корхонаси\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-088

🔰 Бош мухандис	
☎️ Телефон номери: 55-538

🔰 Ҳисобчи	
☎️ Телефон номери: 55-531

🔰 Техника бўлими	
☎️ Телефон номери: 55-534

🔰 Навбатчи қаровул	
☎️ Телефон номери: 55-535

</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_2)

@dp.message_handler(text="“Қорабайир” отчилик мажмуаси")
async def bolim_24(message: types.Message):
    text = """<b>
🔹 “Қорабайир” отчилик мажмуаси\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-093

🔰 Бошлиқ ўринбосари	
☎️ Телефон номери: 55-284

🔰 Маркетинг бўлими	
☎️ Телефон номери: 55-283

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-516

🔰 Ҳодимлар бўлими	
☎️ Телефон номери: 55-514

🔰 Меҳнат хавфсизлиги муҳандиси  	
☎️ Телефон номери: 55-347

🔰 Мажлислар зали   	
☎️ Телефон номери: 55-193  55-195

58-746
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_2)

@dp.message_handler(text="Қарши бекати (ДС)")
async def bolim_25(message: types.Message):
    text = """<b>
🔹 Қарши бекати (ДС)\n\n
🔰 Бекат бошлиғи	
☎️ Телефон номери: 55-012

🔰 Бош муҳандис	
☎️ Телефон номери: 55-019

🔰 Қабулхона	
☎️ Телефон номери: 55-202

75 227-07-23
🔰 Қарши бекати бошлиғининг тезкор ишлар бўйича ўринбосари	
☎️ Телефон номери: 55-094

🔰 Қарши бекати бошлиғининг юк ва тижорат ишлари бўйича ўринбосари	
☎️ Телефон номери: 55-151

🔰 Ҳодимлар бўлими	
☎️ Телефон номери: 55-143

🔰 Иқтисодчи	
☎️ Телефон номери: 55-101

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-115

🔰 Юк ҳовлиси ҳужжатларни расмийлаштирувчи ҳисобчи	
☎️ Телефон номери: 55-097

🔰 Меҳнат муҳофазаси муҳандиси	
☎️ Телефон номери: 55-111

🔰 Қарши бекати бошлиғининг юк ва тижорат ишлари бўйича ўринбосари	
☎️ Телефон номери: 55-051

🔰 Ўкитиш ишлари бўйича йўриқчи	
☎️ Телефон номери: 55-177

🔰 Юк ҳужжатларини расмийлаштирувчи ҳисобчи	
☎️ Телефон номери: 55-104

🔰 Юк ҳужжатларини расмийлаштиш бўлими бошлиғи	
☎️ Телефон номери: 55-103

🔰 Юк қабул қилувчи ва топширувчи	
☎️ Телефон номери: 55-106

🔰 Вагонлар ҳаракат тезлигини камайтирувчилар	
☎️ Телефон номери: 58-751

🔰 Юк ҳужжатларини расмийлаштириш бўлими	
☎️ Телефон номери: 55-105

🔰 Ҳужжатларни расмийлаштириш бўлими	
☎️ Телефон номери: 55-109

🔰 Маневровой диспетчер	
☎️ Телефон номери: 58-711

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-710

🔰 Бекат навбатчи оператори	
☎️ Телефон номери: 58-714

🔰 Поездларни қабул қилувчилар	
☎️ Телефон номери: 55-116

🔰 Оператор сетуатор	
☎️ Телефон номери: 55-464

🔰 Саралаш тепача навбатчиси	
☎️ Телефон номери: 55-114

🔰 Бекат технологик маркази бошлиғи	
☎️ Телефон номери: 55-118

🔰 Бекат технологик маркази оператори	
☎️ Телефон номери: 55-110

🔰 Бекат технологик маркази оператори	
☎️ Телефон номери: 55-112

🔰 Янги парк оператори	
☎️ Телефон номери: 56-819

🔰 Назорат пости	
☎️ Телефон номери: 56-831

🔰 Техник кутубхона	
☎️ Телефон номери: 55-149

🔰 Юк ташиш бўлими	
☎️ Телефон номери: 55-582,   55-583

🔰 Вагонлар оператори	
☎️ Телефон номери: 58-719

🔰 СЦБ бўйича электромеханик	
☎️ Телефон номери: 58-713

🔰 Алоқа бўйича электромеханик	
☎️ Телефон номери: 58-712
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_2)

@dp.message_handler(text="Қарши Транспорт прокуратураси")
async def bolim_26(message: types.Message):
    text = """<b>
🔹 Қарши Транспорт прокуратураси\n\n
🔰 Прокурор	
☎️ Телефон номери: 55-010

🔰 Прокурор ёрдамчиси	
☎️ Телефон номери: 55-036

🔰 Терговчи	
☎️ Телефон номери: 55-035

🔰 Нозир	
☎️ Телефон номери: 55-066

🔰 Назорат пункти	
☎️ Телефон номери: 55-282
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)

@dp.message_handler(text="Қашқадарё вилояти Давлат хавфсизлик хизмати")
async def bolim_27(message: types.Message):
    text = """<b>
🔹 Қашқадарё вилояти Давлат хавфсизлик хизмати\n\n
🔰 Бошқармаси	
☎️ Телефон номери: 55-330

🔰 Навбатчи	
☎️ Телефон номери: 55-368

🔰 Куратор «Вокзал»	
☎️ Телефон номери: 55-376 
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)

@dp.message_handler(text="Транспортда Хафсизликни Таъминлаш Бошқармаси")
async def bolim_28(message: types.Message):
    text = """<b>
🔹 Транспортда Хафсизликни Таъминлаш Бошқармаси\n\n
🔰 Бoшлиқ	
☎️ Телефон номери: 55-015

🔰 1-ўринбосар	
☎️ Телефон номери: 55-056

🔰 Хизмат бўйича ўринбосар	
☎️ Телефон номери: 55-070

🔰 Ходимлар бўйича ўринбосар	
☎️ Телефон номери: 55-058

🔰 ТХТБ навбатчилик қисми	
☎️ Телефон номери: 55-059

🔰 ЖҚБ бошлиғи	
☎️ Телефон номери: 55-555

🔰 Тезкор вакил	
☎️ Телефон номери: 55-888

🔰 Тезкор вакил	
☎️ Телефон номери: 55-444

🔰 Тезкор вакил	
☎️ Телефон номери: 55-465

🔰 Терговчи	
☎️ Телефон номери: 55-439

🔰 ХПГ	
☎️ Телефон номери: 55-063

🔰 ХПГ	
☎️ Телефон номери: 55-442

🔰 ХПГ	
☎️ Телефон номери: 55-467

🔰 ЖТСГ	
☎️ Телефон номери: 55-443

🔰 Кассир	
☎️ Телефон номери: 55-465

🔰 НУП	
☎️ Телефон номери: 55-432

🔰 Котибият	
☎️ Телефон номери: 55-436

🔰 Китоб бекати ХТБ	
☎️ Телефон номери: 63-308

🔰 Тошғузор бекати ХТБ	
☎️ Телефон номери: 55-595

🔰 Дехконобод бекати ХТБ	
☎️ Телефон номери: 30-174

🔰 Окрабод бекати ХТБ	
☎️ Телефон номери: 55-515

🔰 Қабулхона	
☎️ Телефон номери: 55-440

🔰 Тезкор вакил	
☎️ Телефон номери: 55-459

🔰 Тезкор вакил	
☎️ Телефон номери: 55-477

🔰 Тезкор вакил	
☎️ Телефон номери: 55-454

🔰 Маънавият хонаси	
☎️ Телефон номери: 55-472

🔰 Тезкор вакил	
☎️ Телефон номери: 55-445

🔰 ЖТСГ	
☎️ Телефон номери: 55-463

🔰 Фуқаролар қабулхонаси	
☎️ Телефон номери: 55-476

🔰 ТХТБ навбатчилик қисми	
☎️ Телефон номери: 55-022

🔰 Оқрабод ХТБ бошлиғи	
☎️ Телефон номери: 55-441

🔰 Комендатура	
☎️ Телефон номери: 55-528

🔰 Қашқадарё бекати ХТБ	
☎️ Телефон номери: 55-286

🔰 ХПГ	
☎️ Телефон номери: 55-048
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)

@dp.message_handler(text="Қарши темир йўл бекати шахобчаси ва аэрапортларда харбий ҳаракатлар бўлими")
async def bolim_29(message: types.Message):
    text = """<b>
🔹 Қарши темир йўл бекати шахобчаси ва 
аэрапортларда харбий ҳаракатлар бўлими\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-069

🔰 Бошлиқ ўринбосари	
☎️ Телефон номери: 55-168

🔰 Катта ёрдамчи	
☎️ Телефон номери: 55-170

🔰 Навбатчи	
☎️ Телефон номери: 55-169
☎️ Телефон номери: 55-173
☎️ Телефон номери: 55-528

🔰 Махфий иш юритиш бўлими	
☎️ Телефон номери: 55-171

🔰 Ўқув синф хонаси	
☎️ Телефон номери: 55-167

☎️ Телефон номери: 55-174
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)

@dp.message_handler(text="Қарши ҳарбийлаштирилган қўриқлаш отряди штаби ва отряд таркибидаги командалар")
async def bolim_30(message: types.Message):
    text = """<b>
🔹 Қарши ҳарбийлаштирилган қўриқлаш отряди штаби
ва отряд таркибидаги командалар\n\n
🔰 Отряд бошлиғи	
☎️ Телефон номери: 55-065

🔰 Отряд бошлиғи ўринбосари	
☎️ Телефон номери: 55-305

🔰 Отряд ЁХБ бошлиқ ўринбосари	
☎️ Телефон номери: 55-369

🔰 Қарши ҳарбийлаштирилган қўриқлаш отряд бошлиғи ёнғин хавфсизлиги бўйича ўринбосари	
☎️ Телефон номери: 55-396

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-361

🔰 Ҳисобчи	
☎️ Телефон номери: 55-395

🔰 Ходимлар бўлими	
☎️ Телефон номери: 55-364

🔰 Меҳнат муҳофазаси ва техника муҳандиси	
☎️ Телефон номери: 55-394

🔰 Катта йўриқчилар	
☎️ Телефон номери: 55-360

🔰 Диспетчер	
☎️ Телефон номери: 55-394

☎️ Телефон номери: 55-362

🔰 Маънавий-маърифатхонаси	
☎️ Телефон номери: 55-370
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)

@dp.message_handler(text="Қарши ўкчилик ўт ўчириш командаси")
async def bolim_31(message: types.Message):
    text = """<b>
🔹 Қарши ўкчилик ўт ўчириш командаси\n\n
Қарши ўқчилик ўт ўчириш командаси бошлиғи	
☎️ Телефон номери: 55-480

🔰 Қарши ўқчилик ўт ўчириш командаси бошлиғи ўринбосари	
☎️ Телефон номери: 55-365

🔰 Қарши ўқчилик ўт ўчириш командаси бошлиғининг ёнғин хавфсизлиги бўйича ўринбосари	
☎️ Телефон номери: 55-197

🔰 Қарши ўқчилик ўт ўчириш командаси қоровул бошлиғи	
☎️ Телефон номери: 55-199
  58-761
🔰 Ўт ўчириш поезди	
☎️ Телефон номери: 55-281

🔰 Қашқадарё ўқчилик командаси бошлиғи 	
☎️ Телефон номери: 58-585

🔰 Қашқадарё ўқчилик командаси бошлиғи ўринбосари	
☎️ Телефон номери: 58-670

🔰 Қашқадарё ўқчилик командаси қоровул бошлиғи	
☎️ Телефон номери: 55-185
  58-561
🔰 Китоб ўқчилик командаси бошлиғи	
☎️ Телефон номери: 63-320

🔰 Китоб ўқчилик командаси қоровул бошлиғи	
☎️ Телефон номери: 63-316

🔰 Дехқонобод ўқчилик командаси бошлиғи	
☎️ Телефон номери: 30-171

🔰 Дехқонобод ўқчилик командаси қаровул бошлиғи	
☎️ Телефон номери: 30-170

</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)

@dp.message_handler(text="Қарши 4301-сонли  тиклаш поезди")
async def bolim_32(message: types.Message):
    text = """<b>
🔹 Қарши 4301-сонли  тиклаш поезди\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-038

🔰 Бошлиқ ўринбосари	
☎️ Телефон номери: 55-155

🔰 Навбатчи	
☎️ Телефон номери: 55-229

🔰 Дам олиш хонаси	
☎️ Телефон номери: 55-150

</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)

@dp.message_handler(text="“Ўзтемирйўлйўловчи” АЖ “Қашқадарё филиали")
async def bolim_33(message: types.Message):
    text = """<b>
🔹 “Ўзтемирйўлйўловчи” АЖ “Қашқадарё филиали\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-018

🔰 Ҳаракат хавфсизлиги бўйича ёрдамчи	
☎️ Телефон номери: 55-582

🔰 Қарши вокзал бошлиғи 	
☎️ Телефон номери: 55-081

🔰 Ходимлар бўлими	
☎️ Телефон номери: 55-578

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-575

🔰 Ҳисобчилар бўлими	
☎️ Телефон номери: 55-576

🔰 Иқтисодчи	
☎️ Телефон номери: 55-501

🔰 Меҳнат муҳофазаси бўйича муҳандис	
☎️ Телефон номери: 55-492

🔰 Темир йўл чипталар бўйича катта кассир	
☎️ Телефон номери: 55-577

🔰 Темир йўл чиптахона йўриқчиси	
☎️ Телефон номери: 55-594

🔰 Темир йўл чипталарини сотувчиси	
☎️ Телефон номери: 55-540

🔰 Ҳисоб ва ҳисобот гуруҳи	
☎️ Телефон номери: 55-498

🔰 Темир йўл чипталар маълумотхонаси	
☎️ Телефон номери: 55-585

🔰 Вокзал навбатчиси	
☎️ Телефон номери: 55-481

🔰 Юк хона бўлими	
☎️ Телефон номери: 55-590

🔰 Меҳмонхона	
☎️ Телефон номери: 55-451

🔰 ВИП зал 	
☎️ Телефон номери: 55-466

🔰 Мажлислар зали	
☎️ Телефон номери: 55-453

Темир йўл чипталар кассаси  Оқрабод бекати	
☎️ Телефон номери: 53-413

Темир йўл чипталар кассаси Деҳқонобод бекати	
☎️ Телефон номери: 30-186
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)

@dp.message_handler(text="“Ўзтемирйўлконтейнер” АЖ “Қарши МТУ” УК бўлими")
async def bolim_34(message: types.Message):
    text = """<b>
🔹 “Ўзтемирйўлконтейнер” АЖ “Қарши МТУ” УК бўлими\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 55-077

🔰 Ҳисобчилар бўлими	
☎️ Телефон номери: 55-447

🔰 Юк ғазначилар хонаси	
☎️ Телефон номери: 55-452

</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)

@dp.message_handler(text="Қарши “Темирйўлёнилғитаъмин” бошқармаси")
async def bolim_35(message: types.Message):
    text = """<b>
🔹 Қарши “Темирйўлёнилғитаъмин” бошқармаси\n\n
🔰 Бошлиқ	
☎️ Телефон номери: 56-766

🔰 Бошлиқ ўинбосари	
☎️ Телефон номери: 56-796

🔰 Ходимлар бўлими	
☎️ Телефон номери: 56-795,  56-765

🔰 Бош ҳисобчи	
☎️ Телефон номери: 56-794

🔰 Ҳисобчилар бўлими	
☎️ Телефон номери: 56-793

🔰 Меҳнат муҳофазаси бўйича муҳандиси	
☎️ Телефон номери: 56-786

🔰 Ҳуқуқшунос	
☎️ Телефон номери: 56-770

🔰 Оператор	
☎️ Телефон номери: 56-803

🔰 Локомотивларга ёқилғи таъминлаш пункти	
☎️ Телефон номери: 56-788

🔰 Насослар бўлими 	
☎️ Телефон номери: 56-782

🔰 Ҳисобчилар бўлими	
☎️ Телефон номери: 56-793

🔰 Иситиш қурилмалари бўйича нозир	
☎️ Телефон номери: 56-865

🔰 Ёқилғи қуйиш шахобчаси	
☎️ Телефон номери: 55-431

🔰 Назорат пункти	
☎️ Телефон номери: 56-801
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)

@dp.message_handler(text="Қарши тармоқ санитария эпидемиология маркази (СЭС)")
async def bolim_36(message: types.Message):
    text = """<b>
🔹 Қарши тармоқ санитария эпидемиология маркази (СЭС)\n\n
🔰 Бош врач	
☎️ Телефон номери: 55-541

🔰 Ҳисобчи	
☎️ Телефон номери: 55-543

🔰 Санитария-эпидемиология бўлими	
☎️ Телефон номери: 55-545
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)

@dp.message_handler(text="Қарши темир йўл шифохонаси")
async def bolim_37(message: types.Message):
    text = """<b>
🔹 Қарши темир йўл шифохонаси\n\n
🔰 Бош шифокор	
☎️ Телефон номери: 55-228
☎️ 75 227-53-78

🔰 Поликлиника бошлиғи	
☎️ Телефон номери: 55-429

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-416
☎️ 75 227-15-40

🔰 Қабулхона	
☎️ Телефон номери: 55-419

🔰 Тиббий статист	
☎️ Телефон номери: 55-425

🔰 Болалар бўлими	
☎️ Телефон номери: 55-418

🔰 Болалар маслахатхонаси	
☎️ Телефон номери: 55-415

🔰 Ички касалликлар бўлими	
☎️ Телефон номери: 55-423

🔰 Жарроҳлик бўлими	
☎️ Телефон номери: 55-420,  55-427

🔰 Поликлиника рўйхатхонаси	
☎️ Телефон номери: 55-421

🔰 Дорихона 	
☎️ Телефон номери: 55-422

🔰 Таҳлилхона	
☎️ Телефон номери: 55-424

🔰 Физиотерапия 	
☎️ Телефон номери: 55-411

🔰 Фиотерапия	
☎️ Телефон номери: 55-428

🔰 Эндокринолог хонаси	
☎️ Телефон номери: 55-434

🔰 Бош ҳамшира	
☎️ Телефон номери: 55-417

🔰 МТУ-5 даволаниш хонаси	
☎️ Телефон номери: 55-382

🔰 МТУ-5 даволаниш хонаси қабулхонаси	
☎️ Телефон номери: 55-426

</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)

@dp.message_handler(text="“Қарши МТУ” УК Касаба уюшмасининг ҳудудий қўмитаси")
async def bolim_38(message: types.Message):
    text = """<b>
🔹 “Қарши МТУ" УК Касаба уюшмасининг ҳудудий қўмитаси\n\n
🔰 Раис	
☎️ Телефон номери: 55-034

🔰 Қабулхона	
☎️ Телефон номери: 55-314

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-358

🔰 Ташкилий ишлар бўлими	
☎️ Телефон номери: 55-349

🔰 Техника хавфсизлик муҳандиси	
☎️ Телефон номери: 55-295

🔰 Ҳуқуқшунос	
☎️ Телефон номери: 55-536

🔰 Бадиий китоблар кутибхонаси	
☎️ Телефон номери: 55-153

🔰 “Қарши МТУ” УК Бошланғич касаба уюшма қумитаси раиси	
☎️ Телефон номери: 55-529

</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_3)




@dp.message_handler(text="Қарши-Мароқанд темир йўл участкаси бекати телефон рақамлари")
async def bolim_39(message: types.Message):
    text = """<b>
🔹 Қарши-Мароқанд темир йўл участкаси бекати телефон рақамлари\n\n
🔷 Қашқадарё бекати
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-277

🔰 Бекат навбатчиси	
☎️ Телефон номери: 55-294

🔰 Юк қабулқилувчи ва топширувчи	
☎️ Телефон номери: 55-628

🔰 Контакт тармоқлар цехи	
☎️ Телефон номери: 30-062

🔰 Тортув нимстанцияси	
☎️ Телефон номери: 58-280

🔰 ВОХР	
☎️ Телефон номери: 55-185

🔷 Негуз бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-306

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-304

🔰 Электромеханик	
☎️ Телефон номери: 58-732

🔷 Алатун бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-302

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-748

🔰 Электромеханик	
☎️ Телефон номери: 58-303

🔷 Айратам бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-291

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-290

🔰 Электромеханик	
☎️ Телефон номери: 58-292

🔰 Контакт тармоқлар цехи	
☎️ Телефон номери: 58-372

🔰 Вагонларни назорат пости	
☎️ Телефон номери: 58-295

🔷 Жом бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-221

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-220

🔰 Электромеханик	
☎️ Телефон номери: 58-222

🔷 Улус бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-307

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-749

🔰 Электромеханик	
☎️ Телефон номери: 58-103

🔷 Гумбаз бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-101

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-100

🔰 Электромеханик	
☎️ Телефон номери: 58-102,  58-124
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_4)

@dp.message_handler(text="Қарши-Китоб темир йўл участкаси бекати телефон рақамлари")
async def bolim_40(message: types.Message):
    text = """<b>
🔹 Қарши-Китоб темир йўл участкаси бекати телефон рақамлари\n\n
🔷 Дашт бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-002

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-000,  30-001

🔰 Алоқа электромеханиги	
☎️ Телефон номери: 30-004

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-006

🔷 Шўртан бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-022

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-020,  30-021

🔰 Алоқа электромеханиги	
☎️ Телефон номери: 30-024

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-026

🔷 Тошғузор бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-042

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-040,  30-041, 55-179

🔰 Алоқа электромеханиги	
☎️ Телефон номери: 30-044

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-046

🔰 29-сонли Тошғузор туман контакт тармоғи	
☎️ Телефон номери: 30-054, 30-056

🔰 29-сонли Тошғузор тортув нимстанцияси	
☎️ Телефон номери: 30-050, 30-052

🔷 Ғузор бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 63-184

🔰 Бекат навбатчиси	
☎️ Телефон номери: 63-181, 63-180

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 63-185

🔰 Юк хазиначиси 	
☎️ Телефон номери: 63-188

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 63-189

🔰 42 км темир йўл кесишмаси	
☎️ Телефон номери: 63-327

🔰 48 км темир йўл кесишмаси	
☎️ Телефон номери: 63-327

🔰 53 км темир йўл кесишмаси	
☎️ Телефон номери: 63-327

🔷 Қамаши бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 63-214

🔰 Бекат навбатчиси	
☎️ Телефон номери: 63-210,  63-211

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 63-215

🔰 Юк хазиначиси 	
☎️ Телефон номери: 63-218

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 63-219

🔰 77 км темир йўл кесишмаси	
☎️ Телефон номери: 63-249

🔷 Яккабоғ бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 63-244

🔰 Бекат навбатчиси	
☎️ Телефон номери: 63-240,  63-241

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 63-245

🔰 Юк хазиначиси 	
☎️ Телефон номери: 63-248

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 63-249

🔰 30-сонли Яккабоғ туман контакт тармоғи	
☎️ Телефон номери: 95 682-80-21

🔰 101 км темир йўл кесишмаси	
☎️ Телефон номери: 63-269

🔷 Танхоз бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 63-274

🔰 Бекат навбатчиси	
☎️ Телефон номери: 63-270,  63-271

🔰 Алоқа электромеханиги	
☎️ Телефон номери: 63-276

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 63-275

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 63-279

🔰 107 км темир йўл кесишмаси	
☎️ Телефон номери: 63-299

🔰 111 км темир йўл кесишмаси	
☎️ Телефон номери: 63-327

🔷 Китоб бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 63-314

🔰 Бекат бошлиқ ўринбосари	
☎️ Телефон номери: 63-313

🔰 Бекат навбатчиси	
☎️ Телефон номери: 63-300

🔰 Йўл устаси	
☎️ Телефон номери: 63-306

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 63-305

🔰 Маҳсулотлар кассири	
☎️ Телефон номери: 63-318

🔰 Юк хазиначиси 	
☎️ Телефон номери: 63-317

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 63-315

🔰 115 км темир йўл кесишмаси	
☎️ Телефон номери: 63-328

🔰 121 км темир йўл кесишмаси	
☎️ Телефон номери: 63-329
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_4)

@dp.message_handler(text="Тошғузор-Оқработ темир йўл участкаси бекати телефон рақамлари")
async def bolim_41(message: types.Message):
    text = """<b>
🔹 Тошғузор-Оқработ темир йўл участкаси бекати телефон рақамлари\n\n
🔷 Қайирма бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-092

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-090,  30-091, 55-269

🔰 Йўл устаси	
☎️ Телефон номери: 30-100

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-096

🔷 Бузахўр бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-112,  58-891

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-110,  30-111, 55-270

🔰 Йўл устаси	
☎️ Телефон номери: 58-890

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-116

🔷 Жарқудуқ бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-132

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-130,  30-131, 55-271

🔰 Йўл устаси	
☎️ Телефон номери: 30-140

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-136   

🔰 Алоқа электромеханиги	
☎️ Телефон номери: 30-134

🔷 Деҳқонобод бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-152

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-150,  30-151

🔰 Юк хазиначиси 	
☎️ Телефон номери: 30-172

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 30-183

🔰 Йўл устаси	
☎️ Телефон номери: 30-176

🔰 МПЦ бўйича ШЧ-8 бошлиқ ўринбосари	
☎️ Телефон номери: 30-185

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-154   

🔰 Вагонларга техник хизмат кўрсатиш шахобчаси	
☎️ Телефон номери: 30-179

🔰 Техник хизмат кўрсатиш шахобчаси бошлиғи (ПТО)	
☎️ Телефон номери: 30-180

🔰 ВЧД-8 бошлиқ ўринбосари	
☎️ Телефон номери: 30-181

🔰 Касса	
☎️ Телефон номери: 30-186

🔰 31-сонли Дехқонобод туман контакт тармоғи	
☎️ Телефон номери: 30-163

🔰 31-сонли Дехқонобод тортув нимстанцияси	
☎️ Телефон номери: 30-162

🔰 Тиббиёт хонаси	
☎️ Телефон номери: 30-173

🔰 Транспортда хафсизликни таъминлаш бошқармаси бўлими	
☎️ Телефон номери: 30-177

🔰 Дехқонобод ўқчилик командаси бошлиғи	
☎️ Телефон номери: 30-171

🔰 Дехқонобод ўқчилик командаси қаровул бошлиғи	
☎️ Телефон номери: 30-170

🔷 Қорадахна бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-202

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-200, 30-201, 55-273

🔰 Йўл устаси	
☎️ Телефон номери: 30-210

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-206

🔰 Чашмаиҳафизон бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-222

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-220, 30-221, 55-274

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-226

🔷 Оқрабод бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-242

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-240, 30-241

🔰 Оператор	
☎️ Телефон номери: 53-444

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 30-

🔰 Касса	
☎️ Телефон номери: 53-413

🔰 Транспортда хафсизликни таминлаш бошкармаси бўлими	
☎️ Телефон номери: 53-416, 53-505

🔰 Йўл устаси	
☎️ Телефон номери: 30-256

🔰 Тормозларни синаш шахобчаси вагон назоратчилари	
☎️ Телефон номери: 53-420

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 53-512

🔰 32-сонли Оқрабод туман контакт тармоғи	
☎️ Телефон номери: 53-425, 95 325-25-95

🔰 32-сонли Оқрабод тортув нимстанцияси	
☎️ Телефон номери: 53-423; 30-250; 30-252
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_4)

@dp.message_handler(text="Қарши-Мароқанд темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари")
async def bolim_42(message: types.Message):
    text = """<b>
🔹 Қарши-Мароқанд темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари\n\n
🔰 4122 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-401; 58-690

🔰 3860 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-522

🔰 3857 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-521

🔰 3834 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-450; 58-535

🔰 3822 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-582; 58-402

🔰 3812 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-702; 58-381

🔰 3804 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-293 58-400

🔰 3766 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-107  58-140

🔰 3753 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-082

🔰 3746 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-081

🔰 3741 км йўл кесишма навбатчиси
☎️ Телефон номери: 58-080

</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_4)

@dp.message_handler(text="Қарши-Китоб темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари")
async def bolim_43(message: types.Message):
    text = """<b>
🔹 Қарши-Китоб темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари\n\n
🔰 3 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-730; 58-731

🔰 10 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-819

🔰 14 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-818

🔰 19 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-817

🔰 30 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-816

🔰 42 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-208

🔰 48 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-209

🔰 53 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-207

🔰 77 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-239

🔰 101 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-269

🔰 107 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-299

🔰 111 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-327

🔰 115 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-328

🔰 121 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-329

</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_4)

@dp.message_handler(text="Қарши-Рзд.154 темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари")
async def bolim_44(message: types.Message):
    text = """<b>
🔹 Қарши-Рзд.154 темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари\n\n
🔰 4130  км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-733  58-734
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_4)

@dp.message_handler(text="Тошғузор-Қайирма темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари")
async def bolim_45(message: types.Message):
    text = """<b>
🔹 Тошғузор-Қайирма темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари\n\n
🔰 1 км йўл кесишма навбатчиси	
☎️ Телефон номери: 69-626
</b>"""
    await message.answer(text ,parse_mode = 'HTML', reply_markup = bosh_sahifa_qarshi_bolimlar_4)





class Auth(StatesGroup):
    name = State()

@dp.message_handler(text="🔎 Qidiruv", state="*")
async def on_start_2(message: types.Message, state: FSMContext):
    await state.reset_state(with_data=True)
    await message.answer(f"<b>🔍 Қайси бўлимни қидирамиз?</b>\n\n<i>✅ Илтимос бўлим номини тольиқ ёзинг!</i>", parse_mode="HTML", reply_markup=types.ReplyKeyboardRemove())
    await Auth.name.set()

@dp.message_handler(state=Auth.name)
async def name(message: types.Message, state: FSMContext):
    name = message.text
    if name.isdigit():
        await message.answer(f"<b>Raqam kiritish mumkin emas!</b>", parse_mode="HTML", reply_markup=bosh_sahifa)

    else:
        await state.update_data(name=name)
        data = await state.get_data()
        await message.answer(f"<b>Qidirgan malumotingiz: </b><i>{data.get('name')}</i>", parse_mode="HTML" ,reply_markup=bosh_sahifa)
        dict_contac = {
"МТУ-5 бошлиғи , бош муҳандис ва ёрдамчилари":"""
🔰 “Қарши МТУ” УК бошлиғи	
☎️ Telefon nomeri: 55-000

🔰 Қабулхона	
☎️ Telefon nomeri: 55-027

🔰 Факс 	
☎️ Telefon nomeri: 55-329

🔰 Котибият бўлим бошлиғи	
☎️ Telefon nomeri: 55-004

🔰 МТУ-5 хавфсизлик бўйича ёрдамчиси	
☎️ Telefon nomeri: 55-386

🔰 МТУ бош муҳандиси	
☎️ Telefon nomeri: 55-001

🔰 МТУ бош муҳандис ўринбосари	
☎️ Telefon nomeri: 55-008

🔰 МТУ бошлиқ ўринбосари	
☎️ Telefon nomeri: 55-002

🔰 МТУ бош муҳандиси ва МТУ бошлиқ ўринбосари қабулхонаси	
☎️ Telefon nomeri: 55-389

🔰 МТУ бошлиқ ўринбосарининг тезкор ишлар бўйича ёрдамчиси	
☎️ Telefon nomeri: 55-005

🔰 МТУ бошлиқ ўринбосарининг техник ишлар бўйича ёрдамчиси	
☎️ Telefon nomeri: 55-302

🔰 МТУ бошлиқ ўринбосарининг техника хавфсизлиги бўйича муҳандиси	
☎️ Telefon nomeri: 55-390 

""",
"Ходимлар ва ижтимоий масалалар бўлими":"""
🔰 Бошлиқ 	
☎️Telefon nomeri: 55-003

🔰 Бошлиқ ўринбосари 	
☎️ 55-328

🔰 Ходимлар ва ижтимоий масалалар бўлими етакчи муҳандиси	
☎️ 55-311

🔰 Ходимлар ва ижтимоий масалалар бўлими катта нозири	
☎️ 55-353

""",
"МТУ-5 навбатчи бўлими (ДНЦО)":"""
🔰 Катта навбатчиси	
☎️ Телефон номери: 55-304

🔰 Навбатчи 	
☎️ Телефон номери: 55-029

🔰 Тошғузор-Оқрабод т.й.ў. бўйича навбатчи	
☎️ Телефон номери: 55-026

🔰 Ҳуқуқшунос	
☎️ Телефон номери: 55-306

""",
"Статистика ва ҳисобот бўлими":"""
🔰 Бошлиқ 	
☎️ Телефон номери: 55-062

🔰 Иқтисодчи 	
☎️ 55-355

🔰 Операторлари 	
☎️ Телефон номери: 55-375

🔰 Автоматика бошқарув тизимлари муҳандиси	
☎️ Телефон номери: 55-090

🔰 Автоматика бошқариш тизимлари оператори	
☎️ Телефон номери: 55-318

🔰 Автоматика бошқариш тизимлари ФАКС	
☎️ Телефон номери: 55-343

""",
"Молия бўлими":"""
🔰 Бошлиқ	
☎️ 55-006

🔰 Бошлиқ ўринбосари	
☎️ 55-371

🔰 Оператор	
☎️ 55-335

🔰 Молия бўлими	
☎️ 55-321

""",
"Ҳисобчилар бўлими":"""
🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-020

🔰 Ҳисоб-китоб бўйича ҳисобчи	
☎️ Телефон номери: 55-352

🔰 Материаллар бўйича ҳисобчи	
☎️ Телефон номери: 55-346

🔰 Ҳисобчи	
☎️ Телефон номери: 55-332

🔰 Ҳисобчи	
☎️ Телефон номери: 55-356

""",
"Иқтисодий таҳлил ва прогнозлаш бўлими":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-007

🔰 Ҳажм, сифат ва бошқа кўрсаткичлар бўйича етакчи муҳандиси	
☎️ Телефон номери: 55-331

🔰 Ҳаражатлар бўйича етакчи иқтисодчи	
☎️ Телефон номери: 55-378

🔰 Меҳнатга ҳақ тўлаш бўйича етакчи муҳандиси	
☎️ Телефон номери: 55-334

🔰 Иқтисодчи бўлими	
☎️ Телефон номери: 55-379

""",
"Ҳаридлар бўлими ":"""
🔰 Бошлиқ 	
☎️ Телефон номери: 55-880

🔰 Муҳандис	
☎️ Телефон номери: 55-497

🔰 Нозир	
☎️ Телефон номери: 55-096

""",
"Махсус бўлим":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-055

🔰 Муҳандис	
☎️ Телефон номери: 55-309

🔰 Нозир	
☎️ Телефон номери: 55-324

🔰 Фуқаро муҳофаза муҳандиси	
☎️ Телефон номери: 55-327

""",
"АКТ ва АХ бўлими":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-095

🔰 Муҳандис	
☎️ Телефон номери: 55-291

""",
"Капитал қурилиш бўлими":"""
🔰 Бошлиқ 	
☎️ Телефон номери: 55-050

🔰 Етакчи муҳандиси 	
☎️ Телефон номери: 55-342

🔰 Кадастр	
☎️ Телефон номери: 55-317

""",
"Юк ва тижорат ишлари бўлими":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-017

🔰 Шартномавий таъриф ҳисоблаш ва шахобча йўлларини эксплуатация қилиш бўйича муҳандис	
☎️ Телефон номери: 55-337

🔰 Катта нозир	
☎️ Телефон номери: 55-354

🔰 Юк ташишни режалаштириш муҳандиси	
☎️ Телефон номери: 55-307

🔰 Юк ташиш шартлари бўйича муҳандиси	
☎️ Телефон номери: 55-338

🔰 Етакчи муҳандис	
☎️ Телефон номери: 55-067

""",
"Технологик ҳужжатларни қайта ишлаш маркази 'Тех ПД-5'":"""
🔰 "Тех ПД-5"  бошлиғи	
☎️ Телефон номери: 55-011

🔰 Бошлиқ ўринбосари	
☎️ Телефон номери: 55-486

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-489

Ҳисобчилар бўлими	
☎️ Телефон номери: 55-483

🔰 Муҳандис оператор	
☎️ Телефон номери: 55-484

🔰 Юк хужжатлари ҳисобчиси	
☎️ Телефон номери: 55-485

🔰 Ҳуқуқшунос	
☎️ Телефон номери: 55-487

🔰 Даромадлар бўйича нозирлар	
☎️ Телефон номери: 55-388

""",
"“Қарши МТУ” УК 'Ўзгосжеллдорнадзор' ҳудудий инспектсияси":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-009

🔰 Қабулхона	
☎️ Телефон номери: 55-315

🔰 Умумий бўлим	
☎️ Телефон номери: 55-316

🔰 Умумий бўлим	
☎️ Телефон номери: 55-312

🔰 Умумий бўлим	
☎️ Телефон номери: 55-144

🔰 ФАКС	
☎️ Телефон номери: 227-11-23
""",
"Техника ва техналогия назорат бошқармаси “Қарши МТУ” УК бўлими":"""
🔰 ТТНБ “Қарши МТУ” УК бўйича бош нозир	
☎️ Телефон номери: 55-016

🔰 Аloқа ва СЦБ хўжалиги бўйича нозир	
☎️ Телефон номери: 55-032

🔰 Йўл хужалиги бўйича нозир	
☎️ Телефон номери: 55-310

🔰 Ташишларни ташкил этиш бўйича нозир	
☎️ Телефон номери: 55-322

🔰 Локомотив хўжалиги бўйича нозир	
☎️ Телефон номери: 55-391

🔰 Электр таъминоти хўжалиги бўйича нозир	
☎️ Телефон номери: 55-325

🔰 Вагон хўжалиги бўйича нозир	
☎️ Телефон номери: 58-750

""",
"Техник ишлаб чиқариш бўлими":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-008

🔰 ФАКС	
☎️ Телефон номери: 55-383
☎️ Телефон номери: 75-227-23-44

🔰 Йўл хўжалиги бўйича бўлим бошлиғи	
☎️ Телефон номери: 55-039

🔰 Алоқа, СЦБ ва электр таъминоти етакчи муҳандиси	
☎️ Телефон номери: 55-013

🔰 Электр таъминоти бўйича етакчи муҳандиси	
☎️ Телефон номери: 55-075

🔰 Вагон хўжалиги етакчи мухандиси	
☎️ Телефон номери: 55-380

🔰 Локомотив хўжалиги етакчи мухандиси	
☎️ Телефон номери: 55-313

🔰 Вагонлар сақланиши бўйича етакчи мухандиси	
☎️ Телефон номери: 55-399

🔰 Ёқилғи ва энергетика ресурслари етакчи муҳандиси 	
☎️ Телефон номери: 55-025

🔰 Автотранспорт воситалари бўйича етакчи муҳандиси 	
🔰 Факс 
☎️ Телефон номери: 55-341

🔰 Метролог	
☎️ Телефон номери: 55-397

""",
"Қарши Транспорт прокуратураси":"""
🔰 Прокурор	
☎️ Телефон номери: 55-010

🔰 Прокурор ёрдамчиси	
☎️ Телефон номери: 55-036

🔰 Терговчи	
☎️ Телефон номери: 55-035

🔰 Нозир	
☎️ Телефон номери: 55-066

🔰 Назорат пункти	
☎️ Телефон номери: 55-282  

""",
"Қашқадарё вилояти Давлат хавфсизлик хизмати":"""
🔰 Бошқармаси	
☎️ Телефон номери: 55-330

🔰 Навбатчи	
☎️ Телефон номери: 55-368

🔰 Куратор «Вокзал»	
☎️ Телефон номери: 55-376  

""",
"Транспортда Хафсизликни Таъминлаш Бошқармаси":"""
🔰 Бoшлиқ	
☎️ Телефон номери: 55-015

🔰 1-ўринбосар	
☎️ Телефон номери: 55-056

🔰 Хизмат бўйича ўринбосар	
☎️ Телефон номери: 55-070

🔰 Ходимлар бўйича ўринбосар	
☎️ Телефон номери: 55-058

🔰 ТХТБ навбатчилик қисми	
☎️ Телефон номери: 55-059

🔰 ЖҚБ бошлиғи	
☎️ Телефон номери: 55-555

🔰 Тезкор вакил	
☎️ Телефон номери: 55-888

🔰 Тезкор вакил	
☎️ Телефон номери: 55-444

🔰 Тезкор вакил	
☎️ Телефон номери: 55-465

🔰 Терговчи	
☎️ Телефон номери: 55-439

🔰 ХПГ	
☎️ Телефон номери: 55-063

🔰 ХПГ	
☎️ Телефон номери: 55-442

🔰 ХПГ	
☎️ Телефон номери: 55-467

🔰 ЖТСГ	
☎️ Телефон номери: 55-443

🔰 Кассир	
☎️ Телефон номери: 55-465

🔰 НУП	
☎️ Телефон номери: 55-432

🔰 Котибият	
☎️ Телефон номери: 55-436

🔰 Китоб бекати ХТБ	
☎️ Телефон номери: 63-308

🔰 Тошғузор бекати ХТБ	
☎️ Телефон номери: 55-595

🔰 Дехконобод бекати ХТБ	
☎️ Телефон номери: 30-174

🔰 Окрабод бекати ХТБ	
☎️ Телефон номери: 55-515

🔰 Қабулхона	
☎️ Телефон номери: 55-440

🔰 Тезкор вакил	
☎️ Телефон номери: 55-459

🔰 Тезкор вакил	
☎️ Телефон номери: 55-477

🔰 Тезкор вакил	
☎️ Телефон номери: 55-454

🔰 Маънавият хонаси	
☎️ Телефон номери: 55-472

🔰 Тезкор вакил	
☎️ Телефон номери: 55-445

🔰 ЖТСГ	
☎️ Телефон номери: 55-463

🔰 Фуқаролар қабулхонаси	
☎️ Телефон номери: 55-476

🔰 ТХТБ навбатчилик қисми	
☎️ Телефон номери: 55-022

🔰 Оқрабод ХТБ бошлиғи	
☎️ Телефон номери: 55-441

🔰 Комендатура	
☎️ Телефон номери: 55-528

🔰 Қашқадарё бекати ХТБ	
☎️ Телефон номери: 55-286

🔰 ХПГ	
☎️ Телефон номери: 55-048


""",
"Қарши темир йўл бекати шахобчаси ва аэрапортларда харбий ҳаракатлар бўлими":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-069

🔰 Бошлиқ ўринбосари	
☎️ Телефон номери: 55-168

🔰 Катта ёрдамчи	
☎️ Телефон номери: 55-170

🔰 Навбатчи	
☎️ Телефон номери: 55-169
☎️ Телефон номери: 55-173
☎️ Телефон номери: 55-528

🔰 Махфий иш юритиш бўлими	
☎️ Телефон номери: 55-171

🔰 Ўқув синф хонаси	
☎️ Телефон номери: 55-167

☎️ Телефон номери: 55-174


""",
"Қарши ҳарбийлаштирилган қўриқлаш отряди штаби ва отряд таркибидаги командалар":"""
🔰 Отряд бошлиғи	
☎️ Телефон номери: 55-065

🔰 Отряд бошлиғи ўринбосари	
☎️ Телефон номери: 55-305

🔰 Отряд ЁХБ бошлиқ ўринбосари	
☎️ Телефон номери: 55-369

🔰 Қарши ҳарбийлаштирилган қўриқлаш отряд бошлиғи ёнғин хавфсизлиги бўйича ўринбосари	
☎️ Телефон номери: 55-396

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-361

🔰 Ҳисобчи	
☎️ Телефон номери: 55-395

🔰 Ходимлар бўлими	
☎️ Телефон номери: 55-364

🔰 Меҳнат муҳофазаси ва техника муҳандиси	
☎️ Телефон номери: 55-394

🔰 Катта йўриқчилар	
☎️ Телефон номери: 55-360

🔰 Диспетчер	
☎️ Телефон номери: 55-394

☎️ Телефон номери: 55-362

🔰 Маънавий-маърифатхонаси	
☎️ Телефон номери: 55-370


""",
"Қарши ўкчилик ўт ўчириш командаси":"""
Қарши ўқчилик ўт ўчириш командаси бошлиғи	
☎️ Телефон номери: 55-480

🔰 Қарши ўқчилик ўт ўчириш командаси бошлиғи ўринбосари	
☎️ Телефон номери: 55-365

🔰 Қарши ўқчилик ўт ўчириш командаси бошлиғининг ёнғин хавфсизлиги бўйича ўринбосари	
☎️ Телефон номери: 55-197

🔰 Қарши ўқчилик ўт ўчириш командаси қоровул бошлиғи	
☎️ Телефон номери: 55-199
  58-761
🔰 Ўт ўчириш поезди	
☎️ Телефон номери: 55-281

🔰 Қашқадарё ўқчилик командаси бошлиғи 	
☎️ Телефон номери: 58-585

🔰 Қашқадарё ўқчилик командаси бошлиғи ўринбосари	
☎️ Телефон номери: 58-670

🔰 Қашқадарё ўқчилик командаси қоровул бошлиғи	
☎️ Телефон номери: 55-185
  58-561
🔰 Китоб ўқчилик командаси бошлиғи	
☎️ Телефон номери: 63-320

🔰 Китоб ўқчилик командаси қоровул бошлиғи	
☎️ Телефон номери: 63-316

🔰 Дехқонобод ўқчилик командаси бошлиғи	
☎️ Телефон номери: 30-171

🔰 Дехқонобод ўқчилик командаси қаровул бошлиғи	
☎️ Телефон номери: 30-170


""",
"Қарши 4301-сонли  тиклаш поезди":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-038

🔰 Бошлиқ ўринбосари	
☎️ Телефон номери: 55-155

🔰 Навбатчи	
☎️ Телефон номери: 55-229

🔰 Дам олиш хонаси	
☎️ Телефон номери: 55-150


""",
"“Ўзтемирйўлйўловчи” АЖ “Қашқадарё филиали":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-018

🔰 Ҳаракат хавфсизлиги бўйича ёрдамчи	
☎️ Телефон номери: 55-582

🔰 Қарши вокзал бошлиғи 	
☎️ Телефон номери: 55-081

🔰 Ходимлар бўлими	
☎️ Телефон номери: 55-578

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-575

🔰 Ҳисобчилар бўлими	
☎️ Телефон номери: 55-576

🔰 Иқтисодчи	
☎️ Телефон номери: 55-501

🔰 Меҳнат муҳофазаси бўйича муҳандис	
☎️ Телефон номери: 55-492

🔰 Темир йўл чипталар бўйича катта кассир	
☎️ Телефон номери: 55-577

🔰 Темир йўл чиптахона йўриқчиси	
☎️ Телефон номери: 55-594

🔰 Темир йўл чипталарини сотувчиси	
☎️ Телефон номери: 55-540

🔰 Ҳисоб ва ҳисобот гуруҳи	
☎️ Телефон номери: 55-498

🔰 Темир йўл чипталар маълумотхонаси	
☎️ Телефон номери: 55-585

🔰 Вокзал навбатчиси	
☎️ Телефон номери: 55-481

🔰 Юк хона бўлими	
☎️ Телефон номери: 55-590

🔰 Меҳмонхона	
☎️ Телефон номери: 55-451

🔰 ВИП зал 	
☎️ Телефон номери: 55-466

🔰 Мажлислар зали	
☎️ Телефон номери: 55-453

Темир йўл чипталар кассаси  Оқрабод бекати	
☎️ Телефон номери: 53-413

Темир йўл чипталар кассаси Деҳқонобод бекати	
☎️ Телефон номери: 30-186

""",
"“Ўзтемирйўлконтейнер” АЖ “Қарши МТУ” УК бўлими":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-077

🔰 Ҳисобчилар бўлими	
☎️ Телефон номери: 55-447

🔰 Юк ғазначилар хонаси	
☎️ Телефон номери: 55-452


""",
"Қарши “Темирйўлёнилғитаъмин” бошқармаси":"""
🔰 Бошлиқ	
☎️ Телефон номери: 56-766

🔰 Бошлиқ ўинбосари	
☎️ Телефон номери: 56-796

🔰 Ходимлар бўлими	
☎️ Телефон номери: 56-795,  56-765

🔰 Бош ҳисобчи	
☎️ Телефон номери: 56-794

🔰 Ҳисобчилар бўлими	
☎️ Телефон номери: 56-793

🔰 Меҳнат муҳофазаси бўйича муҳандиси	
☎️ Телефон номери: 56-786

🔰 Ҳуқуқшунос	
☎️ Телефон номери: 56-770

🔰 Оператор	
☎️ Телефон номери: 56-803

🔰 Локомотивларга ёқилғи таъминлаш пункти	
☎️ Телефон номери: 56-788

🔰 Насослар бўлими 	
☎️ Телефон номери: 56-782

🔰 Ҳисобчилар бўлими	
☎️ Телефон номери: 56-793

🔰 Иситиш қурилмалари бўйича нозир	
☎️ Телефон номери: 56-865

🔰 Ёқилғи қуйиш шахобчаси	
☎️ Телефон номери: 55-431

🔰 Назорат пункти	
☎️ Телефон номери: 56-801


""",
"Қарши тармоқ санитария эпидемиология маркази (СЭС)":"""
🔰 Бош врач	
☎️ Телефон номери: 55-541

🔰 Ҳисобчи	
☎️ Телефон номери: 55-543

🔰 Санитария-эпидемиология бўлими	
☎️ Телефон номери: 55-545


""",
"Қарши темир йўл шифохонаси":"""
🔰 Бош шифокор	
☎️ Телефон номери: 55-228
☎️ 75 227-53-78

🔰 Поликлиника бошлиғи	
☎️ Телефон номери: 55-429

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-416
☎️ 75 227-15-40

🔰 Қабулхона	
☎️ Телефон номери: 55-419

🔰 Тиббий статист	
☎️ Телефон номери: 55-425

🔰 Болалар бўлими	
☎️ Телефон номери: 55-418

🔰 Болалар маслахатхонаси	
☎️ Телефон номери: 55-415

🔰 Ички касалликлар бўлими	
☎️ Телефон номери: 55-423

🔰 Жарроҳлик бўлими	
☎️ Телефон номери: 55-420,  55-427

🔰 Поликлиника рўйхатхонаси	
☎️ Телефон номери: 55-421

🔰 Дорихона 	
☎️ Телефон номери: 55-422

🔰 Таҳлилхона	
☎️ Телефон номери: 55-424

🔰 Физиотерапия 	
☎️ Телефон номери: 55-411

🔰 Фиотерапия	
☎️ Телефон номери: 55-428

🔰 Эндокринолог хонаси	
☎️ Телефон номери: 55-434

🔰 Бош ҳамшира	
☎️ Телефон номери: 55-417

🔰 МТУ-5 даволаниш хонаси	
☎️ Телефон номери: 55-382

🔰 МТУ-5 даволаниш хонаси қабулхонаси	
☎️ Телефон номери: 55-426


""",
"“Қарши МТУ” УК Касаба уюшмасининг ҳудудий қўмитаси":"""
🔰 Раис	
☎️ Телефон номери: 55-034

🔰 Қабулхона	
☎️ Телефон номери: 55-314

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-358

🔰 Ташкилий ишлар бўлими	
☎️ Телефон номери: 55-349

🔰 Техника хавфсизлик муҳандиси	
☎️ Телефон номери: 55-295

🔰 Ҳуқуқшунос	
☎️ Телефон номери: 55-536

🔰 Бадиий китоблар кутибхонаси	
☎️ Телефон номери: 55-153

🔰 “Қарши МТУ” УК Бошланғич касаба уюшма қумитаси раиси	
☎️ Телефон номери: 55-529


""",
"Қарши алоқа ва ишорат муассасаси ШЧ-8":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-040

🔰 Бош муҳандис	
☎️ Телефон номери: 55-041

🔰 Қабулхона	
☎️ Телефон номери: 55-240

🔰 СЦБ бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 55-042

🔰 Алоқа бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 55-043

🔰 Ҳодимлар бўлими	
☎️ Телефон номери: 55-037

🔰 Ҳодимлар бўлими нозири	
☎️ Телефон номери: 55-288

🔰 Техник хужжатлар бўлими	
☎️ Телефон номери: 55-021
   55-456
🔰 Техника бўлими	
☎️ Телефон номери: 55-237
  55-044
🔰 Касаба уюшмаси кўмитаси	
☎️ Телефон номери: 55-033

🔰 Меҳнат мухофазаси муҳандиси	
☎️ Телефон номери: 55-061

🔰 Ҳодимлар тайёрлаш муҳандиси	
☎️ Телефон номери: 55-072

🔰 Иқтисодчи	
☎️ Телефон номери: 55-046

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-071

🔰 Материаллар ҳисобчиси	
☎️ Телефон номери: 55-251

🔰 Ойлик маош ҳисобчиси	
☎️ Телефон номери: 55-224

🔰 Маркетинг бўлими	
☎️ Телефон номери: 55-755

🔰 Касса	
☎️ Телефон номери: 55-209

🔰 Катта диспетчер	
☎️ Телефон номери: 55-245

🔰 Диспетчер	
☎️ Телефон номери: 55-045
☎️ Телефон номери: 58-745
☎️ Телефон номери: 227-21-75

🔰 Ёшлар иттифоқи	
☎️ Телефон номери: 55-568

🔰 Телеграф	
☎️ Телефон номери: 55-289

🔰 ТТС цех бошлиғи	
☎️ Телефон номери: 55-210

🔰 АТС катта эл.механиги 	
☎️ Телефон номери: 55-064

🔰 АТС эл.механиклар хонаси	
☎️ Телефон номери: 56-049

🔰 АМК хонаси (Коммутатор) 	
☎️ Телефон номери: 58-771

🔰 АТС кросс	
☎️ Телефон номери: 55-049

🔰 ЛАЗ катта эл.механиги	
☎️ Телефон номери: 55-250

🔰 ЛАЗ навбатчи эл.механиги	
☎️ Телефон номери: 55-047,  58-747

🔰 ЛАЗ ертуласи	
☎️ Телефон номери: 55-230

🔰 ВОЛС эл.механиклари	
☎️ Телефон номери: 58-777

🔰 Видео кузатув цехи	
☎️ Телефон номери: 58-770

🔰 Ишонч группаси цехи	
☎️ Телефон номери: 55-232

🔰 КИП алоқа цехи 	
☎️ Телефон номери: 55-253

🔰 ДЦ эл.механиклари	
☎️ Телефон номери: 55-214

🔰 КИП СЦБ эл.механиклари	
☎️ Телефон номери: 55-249   55-261

🔰 КИП контактсиз аппаратлар	
☎️ Телефон номери: 55-256

🔰 КТСМ эл.механиклари	
🔰 Автотураргоҳ	
☎️ Телефон номери: 55-254

🔰 Омборхона	
☎️ Телефон номери: 55-276

🔰 Кабелчилар	
☎️ Телефон номери: 55-257

🔰 СЦБ кабелчилари	
☎️ Телефон номери: 55-241

🔰 Автомеханик	
☎️ Телефон номери: 55-238

🔰 МРЦ	
☎️ Телефон номери: 55-297

🔰 Алоқа МРЦ релека	
☎️ Телефон номери: 55-234

🔰 КРП	
☎️ Телефон номери: 56-797

🔰 АТС лок депо	
☎️ Телефон номери: 56-764

🔰 Назорат пункти	
☎️ Телефон номери: 55-260


""",
"Қарши электр таъминоти корхонаси (ЭЧ-5)":"""
🔰 Корхона бошлиғи	
☎️ Телефон номери: 55-014

🔰 Бош муҳандис	
☎️ Телефон номери: 55-024

🔰 Контакт тармоғи бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 55-190

🔰 Тортув нимстанциялари бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 58-776

🔰 Қурилиш ишлари бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 55-213

🔰 Қабулхона	
☎️ Телефон номери: 55-227

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-142

🔰 Ҳисобчилар	
☎️ Телефон номери: 55-226

🔰 Техник жараёнларни бошқариш бўлими	
☎️ Телефон номери: 55-219   55-212;

🔰 Факс 
☎️ Телефон номери: 55-211

🔰 Иқтисодчи	
☎️ Телефон номери: 55-220

🔰 Техника хавфсизлиги муҳандиси	
☎️ Телефон номери: 55-141

🔰 Ходимлар бўлими	
☎️ Телефон номери: 55-145

🔰 Электр энергия ҳисоб бўлими	
☎️ Телефон номери: 55-208

🔰 Касаба уюшмаси қўмитаси	
☎️ Телефон номери: 55-522

🔰 Қаровулхона	
☎️ Телефон номери: 55-146

🔰 Энергодиспетчер	
☎️ Телефон номери: 55-216  55-217

75 227-16-18
🔰 ТЕТ-1	
☎️ Телефон номери: 55-235

🔰 Лаборатория	
☎️ Телефон номери: 55-218

🔰 27-сонли Айратом туман контакт тармоғи	
☎️ Телефон номери: 58-372  30-061

🔰 27-сонли Айратом тортув нимстанцияси	
☎️ Телефон номери: 58-270  58-371

🔰 28-сонли Қашқадарё туман контакт тармоғи	
☎️ Телефон номери: 30-062

🔰 28-сонли Қашқадарё тортув нимстанцияси	
☎️ Телефон номери: 58-280  58-046

🔰 29-сонли Тошғузор туман контакт тармоғи	
☎️ Телефон номери: 30-054  30-056

🔰 29-сонли Тошғузор тортув нимстанцияси	
☎️ Телефон номери: 30-050  30-052

🔰 30-сонли Яккабоғ туман контакт тармоғи	
☎️ Телефон номери: 95 682-80-21

🔰 31-сонли Дехқонобод туман контакт тармоғи	
☎️ Телефон номери: 30-163

🔰 31-сонли Дехқонобод тортув нимстанцияси	
☎️ Телефон номери: 30-162

🔰 32-сонли Оқрабод туман контакт тармоғи	
☎️ Телефон номери: 53-425 

95 325-25-95
🔰 32-сонли Оқрабод тортув нимстанцияси	
☎️ Телефон номери: 53-423  30-250 30-252


""",
"Қарши темир йул таъмирлаш корхонаси (ПЧ-12)":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-030

🔰 Бошлиқ қабулхонаси	
☎️ Телефон номери: 55-407

🔰 Бош муҳандис	
☎️ Телефон номери: 55-031

🔰 Ходимлар бўлими	
☎️ Телефон номери: 55-414

🔰 Иқтисодчи	
☎️ Телефон номери: 55-409

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-404

🔰 Ҳисобчилар бўлими	
☎️ Телефон номери: 55-405

🔰 Меҳнатни муҳоваза қилиш бўлими	
☎️ Телефон номери: 55-401

🔰 Техник ишлаб чиқариш бўлими	
☎️ Телефон номери: 55-406

🔰 Диспетчер	
☎️ Телефон номери: 55-410    55-233

🔰 Дефектоскоп операторлар хонаси 	
☎️ Телефон номери: 55-408

🔰 1-бўлинма Қарши бекати	
☎️ Телефон номери: 55-412

🔰 2-бўлинма Қарши бекати	
☎️ Телефон номери: 55-413

🔰 Мажлислар зали	
☎️ Телефон номери: 55-403

🔰 Назорат пункти	
☎️ Телефон номери: 55-400


""",
"Қашқадарё темир йул таъмирлаш корхонаси (ПЧ-14)":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-266

🔰 Бош муҳандис	
☎️ Телефон номери: 55-556

🔰 Техник ишлаб чиқариш бўлими	
☎️ Телефон номери: 55-244    55-275

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-642

🔰 Ҳисобчилар хонаси	
☎️ Телефон номери: 55-632

🔰 Иқтисодчи	
☎️ Телефон номери: 55-633

🔰 Ҳодимлар бўлими	
☎️ Телефон номери: 55-641

🔰 Меҳнат мухофазаси бўйича муҳандис	
☎️ Телефон номери: 55-635

🔰 Навбатчи	
☎️ Телефон номери: 55-631


""",
"№214-сонли йўл машина бекати":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-625

🔰 Қабулхона	
☎️ Телефон номери: 58-762


""",
"Қарши вагон депоси (ВЧД-8)":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-080,   56-201

🔰 Бош муҳандис 	
☎️ Телефон номери: 55-223,   56-202

🔰 Таъмир ишлари бўйича бошлиқ ўринбосари 	
☎️ Телефон номери: 55-139,   56-203

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-087,  56-204

🔰 Бошлиқ ёрдамчиси	
☎️ Телефон номери: 56-227

🔰 Иқтисод бўлими	
☎️ Телефон номери: 56-233

🔰 Хисобчилар хонаси	
☎️ Телефон номери: 56-229
☎️ Телефон номери: 56-230
☎️ Телефон номери: 56-231

🔰 Ҳуқуқшунос	
☎️ Телефон номери: 56-226

🔰 Ходимлар бўлими	
☎️ Телефон номери: 56-234,  56-235

🔰 АХЧ	
☎️ Телефон номери: 56-225

🔰 Маркетинг бўлими бошлиғи	
☎️ Телефон номери: 56-228

🔰 АКТ хонаси	
☎️ Телефон номери: 56-224

🔰 Тиббиёт хонаси	
☎️ Телефон номери: 56-241

🔰 Меҳнатга хақ тўлаш бўлими	
☎️ Телефон номери: 56-236

🔰 Маркетинг хонаси	
☎️ Телефон номери: 56-237

🔰 Техник ишлаб чиқариш бўлими	
☎️ Телефон номери: 56-238 56-239 56-240

🔰 Техник ишлаб чиқариш бўлими бошлиғи	
☎️ Телефон номери: 56-242

🔰 Диспетчер	
☎️ Телефон номери: 55-222,  56-232

🔰 Механика цехи хонаси	
☎️ Телефон номери: 56-243,  56-244

🔰 Омборхона	
☎️ Телефон номери: 56-245

🔰 Бош механик	
☎️ Телефон номери: 56-246

🔰 Қурилиш бўлими	
☎️ Телефон номери: 56-252,   56-255

🔰 Автомеханик	
☎️ Телефон номери: 56-247,   56-248

🔰 Касаба уюшмаси қўмитаси	
☎️ Телефон номери: 56-250

🔰 ПТО	
☎️ Телефон номери: 55-131  

🔰 Техник	
☎️ Телефон номери: 55-132

🔰 Вагонларга техник хизмат кўрсатиш шахобчаси бошлиғи	
☎️ Телефон номери: 55-133

🔰 Вагон оператори	
☎️ Телефон номери: 55-139


""",
"Қарши локомотив депоси (ТЧ-8)":"""
🔰 Бошлиқ	
☎️ Телефон номери: 56-755    55-495

🔰 Бош муҳандис	
☎️ Телефон номери: 56-757

🔰 Қабулхона	
☎️ Телефон номери: 56-776

🔰 Локомотив хўжалиги бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 56-767

🔰 Локомотивларни таъмирлаш бўйича бошлиқ ўринбосари	
☎️ Телефон номери: 56-756

🔰 Навбатчи	
☎️ Телефон номери: 55-493    56-759

🔰 Ходимлар бўлими	
☎️ Телефон номери: 56-783

🔰 Бош ҳисобчи	
☎️ Телефон номери: 56-760

🔰 Материаллар бўйича ҳисобчи	
☎️ Телефон номери: 56-807

🔰 Ойлик маош ҳисобчиси
☎️ Телефон номери: 	56-806

🔰 Меҳнат муҳофазаси бўйича муҳандис	
☎️ Телефон номери: 56-784

🔰 Иқтисодчи	
☎️ Телефон номери: 56-781

🔰 Тезкор ҳисоблаш бўлими	
☎️ Телефон номери: 56-780

🔰 Локомотив ленталарини таҳлил қилиш бўлими	
☎️ Телефон номери: 56-792

🔰 Техник ишлар бўлими	
☎️ Телефон номери: 56-779

🔰 Тиббий назорат пункти	
☎️ Телефон номери: 56-799

🔰 Дам олиш уйи	
☎️ Телефон номери: 56-789

🔰 Назорат пункти	
☎️ Телефон номери: 56-791

🔰 Меҳнатга ҳақ тўлаш муҳандиси	
☎️ Телефон номери: 56-790

🔰 Электровоз цехи бошлиғи	
☎️ Телефон номери: 56-763

🔰 Электровоз цехи мастери	
☎️ Телефон номери: 56-844

🔰 Касаба уюшмаси қўмитаси	
☎️ Телефон номери: 56-808

🔰 КРП эл.механиклар хонаси	
☎️ Телефон номери: 56-797

🔰 АТС хонаси	
☎️ Телефон номери: 56-764

🔰 Қўриқлаш ходимлари	
☎️ Телефон номери: 56-875

🔰 3-назорат пункти	
☎️ Телефон номери: 56-876

🔰 Омборхона  (Зап. част)	
☎️ Телефон номери: 56-809

🔰 Омборхона  (матер част)	
☎️ Телефон номери: 56-810

🔰 Қозонхона	
☎️ Телефон номери: 56-787


""",
"Қарши қурилиш таъмирлаш корхонаси":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-088

🔰 Бош мухандис	
☎️ Телефон номери: 55-538

🔰 Ҳисобчи	
☎️ Телефон номери: 55-531

🔰 Техника бўлими	
☎️ Телефон номери: 55-534

🔰 Навбатчи қаровул	
☎️ Телефон номери: 55-535


""",
"“Қорабайир” отчилик мажмуаси":"""
🔰 Бошлиқ	
☎️ Телефон номери: 55-093

🔰 Бошлиқ ўринбосари	
☎️ Телефон номери: 55-284

🔰 Маркетинг бўлими	
☎️ Телефон номери: 55-283

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-516

🔰 Ҳодимлар бўлими	
☎️ Телефон номери: 55-514

🔰 Меҳнат хавфсизлиги муҳандиси  	
☎️ Телефон номери: 55-347

🔰 Мажлислар зали   	
☎️ Телефон номери: 55-193, 55-195, 58-746

""",
"Қарши бекати (ДС)":"""
🔰 Бекат бошлиғи	
☎️ Телефон номери: 55-012

🔰 Бош муҳандис	
☎️ Телефон номери: 55-019

🔰 Қабулхона	
☎️ Телефон номери: 55-202

75 227-07-23
🔰 Қарши бекати бошлиғининг тезкор ишлар бўйича ўринбосари	
☎️ Телефон номери: 55-094

🔰 Қарши бекати бошлиғининг юк ва тижорат ишлари бўйича ўринбосари	
☎️ Телефон номери: 55-151

🔰 Ҳодимлар бўлими	
☎️ Телефон номери: 55-143

🔰 Иқтисодчи	
☎️ Телефон номери: 55-101

🔰 Бош ҳисобчи	
☎️ Телефон номери: 55-115

🔰 Юк ҳовлиси ҳужжатларни расмийлаштирувчи ҳисобчи	
☎️ Телефон номери: 55-097

🔰 Меҳнат муҳофазаси муҳандиси	
☎️ Телефон номери: 55-111

🔰 Қарши бекати бошлиғининг юк ва тижорат ишлари бўйича ўринбосари	
☎️ Телефон номери: 55-051

🔰 Ўкитиш ишлари бўйича йўриқчи	
☎️ Телефон номери: 55-177

🔰 Юк ҳужжатларини расмийлаштирувчи ҳисобчи	
☎️ Телефон номери: 55-104

🔰 Юк ҳужжатларини расмийлаштиш бўлими бошлиғи	
☎️ Телефон номери: 55-103

🔰 Юк қабул қилувчи ва топширувчи	
☎️ Телефон номери: 55-106

🔰 Вагонлар ҳаракат тезлигини камайтирувчилар	
☎️ Телефон номери: 58-751

🔰 Юк ҳужжатларини расмийлаштириш бўлими	
☎️ Телефон номери: 55-105

🔰 Ҳужжатларни расмийлаштириш бўлими	
☎️ Телефон номери: 55-109

🔰 Маневровой диспетчер	
☎️ Телефон номери: 58-711

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-710

🔰 Бекат навбатчи оператори	
☎️ Телефон номери: 58-714

🔰 Поездларни қабул қилувчилар	
☎️ Телефон номери: 55-116

🔰 Оператор сетуатор	
☎️ Телефон номери: 55-464

🔰 Саралаш тепача навбатчиси	
☎️ Телефон номери: 55-114

🔰 Бекат технологик маркази бошлиғи	
☎️ Телефон номери: 55-118

🔰 Бекат технологик маркази оператори	
☎️ Телефон номери: 55-110

🔰 Бекат технологик маркази оператори	
☎️ Телефон номери: 55-112

🔰 Янги парк оператори	
☎️ Телефон номери: 56-819

🔰 Назорат пости	
☎️ Телефон номери: 56-831

🔰 Техник кутубхона	
☎️ Телефон номери: 55-149

🔰 Юк ташиш бўлими	
☎️ Телефон номери: 55-582,   55-583

🔰 Вагонлар оператори	
☎️ Телефон номери: 58-719

🔰 СЦБ бўйича электромеханик	
☎️ Телефон номери: 58-713

🔰 Алоқа бўйича электромеханик	
☎️ Телефон номери: 58-712


""",
"Қарши-Мароқанд темир йўл участкаси бекати телефон рақамлари":"""
🔷 Қашқадарё бекати
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-277

🔰 Бекат навбатчиси	
☎️ Телефон номери: 55-294

🔰 Юк қабулқилувчи ва топширувчи	
☎️ Телефон номери: 55-628

🔰 Контакт тармоқлар цехи	
☎️ Телефон номери: 30-062

🔰 Тортув нимстанцияси	
☎️ Телефон номери: 58-280

🔰 ВОХР	
☎️ Телефон номери: 55-185

🔷 Негуз бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-306

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-304

🔰 Электромеханик	
☎️ Телефон номери: 58-732

🔷 Алатун бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-302

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-748

🔰 Электромеханик	
☎️ Телефон номери: 58-303

🔷 Айратам бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-291

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-290

🔰 Электромеханик	
☎️ Телефон номери: 58-292

🔰 Контакт тармоқлар цехи	
☎️ Телефон номери: 58-372

🔰 Вагонларни назорат пости	
☎️ Телефон номери: 58-295

🔷 Жом бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-221

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-220

🔰 Электромеханик	
☎️ Телефон номери: 58-222

🔷 Улус бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-307

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-749

🔰 Электромеханик	
☎️ Телефон номери: 58-103

🔷 Гумбаз бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 58-101

🔰 Бекат навбатчиси	
☎️ Телефон номери: 58-100

🔰 Электромеханик	
☎️ Телефон номери: 58-102,  58-124


""",
"Қарши-Китоб темир йўл участкаси бекати телефон рақамлари":"""
🔷 Дашт бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-002

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-000,  30-001

🔰 Алоқа электромеханиги	
☎️ Телефон номери: 30-004

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-006

🔷 Шўртан бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-022

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-020,  30-021

🔰 Алоқа электромеханиги	
☎️ Телефон номери: 30-024

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-026

🔷 Тошғузор бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-042

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-040,  30-041, 55-179

🔰 Алоқа электромеханиги	
☎️ Телефон номери: 30-044

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-046

🔰 29-сонли Тошғузор туман контакт тармоғи	
☎️ Телефон номери: 30-054, 30-056

🔰 29-сонли Тошғузор тортув нимстанцияси	
☎️ Телефон номери: 30-050, 30-052

🔷 Ғузор бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 63-184

🔰 Бекат навбатчиси	
☎️ Телефон номери: 63-181, 63-180

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 63-185

🔰 Юк хазиначиси 	
☎️ Телефон номери: 63-188

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 63-189

🔰 42 км темир йўл кесишмаси	
☎️ Телефон номери: 63-327

🔰 48 км темир йўл кесишмаси	
☎️ Телефон номери: 63-327

🔰 53 км темир йўл кесишмаси	
☎️ Телефон номери: 63-327

🔷 Қамаши бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 63-214

🔰 Бекат навбатчиси	
☎️ Телефон номери: 63-210,  63-211

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 63-215

🔰 Юк хазиначиси 	
☎️ Телефон номери: 63-218

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 63-219

🔰 77 км темир йўл кесишмаси	
☎️ Телефон номери: 63-249

🔷 Яккабоғ бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 63-244

🔰 Бекат навбатчиси	
☎️ Телефон номери: 63-240,  63-241

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 63-245

🔰 Юк хазиначиси 	
☎️ Телефон номери: 63-248

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 63-249

🔰 30-сонли Яккабоғ туман контакт тармоғи	
☎️ Телефон номери: 95 682-80-21

🔰 101 км темир йўл кесишмаси	
☎️ Телефон номери: 63-269

🔷 Танхоз бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 63-274

🔰 Бекат навбатчиси	
☎️ Телефон номери: 63-270,  63-271

🔰 Алоқа электромеханиги	
☎️ Телефон номери: 63-276

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 63-275

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 63-279

🔰 107 км темир йўл кесишмаси	
☎️ Телефон номери: 63-299

🔰 111 км темир йўл кесишмаси	
☎️ Телефон номери: 63-327

🔷 Китоб бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 63-314

🔰 Бекат бошлиқ ўринбосари	
☎️ Телефон номери: 63-313

🔰 Бекат навбатчиси	
☎️ Телефон номери: 63-300

🔰 Йўл устаси	
☎️ Телефон номери: 63-306

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 63-305

🔰 Маҳсулотлар кассири	
☎️ Телефон номери: 63-318

🔰 Юк хазиначиси 	
☎️ Телефон номери: 63-317

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 63-315

🔰 115 км темир йўл кесишмаси	
☎️ Телефон номери: 63-328

🔰 121 км темир йўл кесишмаси	
☎️ Телефон номери: 63-329


""",
"Тошғузор-Оқработ темир йўл участкаси бекати телефон рақамлари":"""
🔷 Қайирма бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-092

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-090,  30-091, 55-269

🔰 Йўл устаси	
☎️ Телефон номери: 30-100

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-096

🔷 Бузахўр бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-112,  58-891

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-110,  30-111, 55-270

🔰 Йўл устаси	
☎️ Телефон номери: 58-890

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-116

🔷 Жарқудуқ бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-132

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-130,  30-131, 55-271

🔰 Йўл устаси	
☎️ Телефон номери: 30-140

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-136   

🔰 Алоқа электромеханиги	
☎️ Телефон номери: 30-134

🔷 Деҳқонобод бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-152

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-150,  30-151

🔰 Юк хазиначиси 	
☎️ Телефон номери: 30-172

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 30-183

🔰 Йўл устаси	
☎️ Телефон номери: 30-176

🔰 МПЦ бўйича ШЧ-8 бошлиқ ўринбосари	
☎️ Телефон номери: 30-185

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-154   

🔰 Вагонларга техник хизмат кўрсатиш шахобчаси	
☎️ Телефон номери: 30-179

🔰 Техник хизмат кўрсатиш шахобчаси бошлиғи (ПТО)	
☎️ Телефон номери: 30-180

🔰 ВЧД-8 бошлиқ ўринбосари	
☎️ Телефон номери: 30-181

🔰 Касса	
☎️ Телефон номери: 30-186

🔰 31-сонли Дехқонобод туман контакт тармоғи	
☎️ Телефон номери: 30-163

🔰 31-сонли Дехқонобод тортув нимстанцияси	
☎️ Телефон номери: 30-162

🔰 Тиббиёт хонаси	
☎️ Телефон номери: 30-173

🔰 Транспортда хафсизликни таъминлаш бошқармаси бўлими	
☎️ Телефон номери: 30-177

🔰 Дехқонобод ўқчилик командаси бошлиғи	
☎️ Телефон номери: 30-171

🔰 Дехқонобод ўқчилик командаси қаровул бошлиғи	
☎️ Телефон номери: 30-170

🔷 Қорадахна бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-202

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-200, 30-201, 55-273

🔰 Йўл устаси	
☎️ Телефон номери: 30-210

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-206

🔰 Чашмаиҳафизон бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-222

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-220, 30-221, 55-274

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 30-226

🔷 Оқрабод бекати	
🔰 Бекат бошлиғи	
☎️ Телефон номери: 30-242

🔰 Бекат навбатчиси	
☎️ Телефон номери: 30-240, 30-241

🔰 Оператор	
☎️ Телефон номери: 53-444

🔰 Юк қабул қилиб топширувчи	
☎️ Телефон номери: 30-

🔰 Касса	
☎️ Телефон номери: 53-413

🔰 Транспортда хафсизликни таминлаш бошкармаси бўлими	
☎️ Телефон номери: 53-416, 53-505

🔰 Йўл устаси	
☎️ Телефон номери: 30-256

🔰 Тормозларни синаш шахобчаси вагон назоратчилари	
☎️ Телефон номери: 53-420

🔰 СЦБ электромеханиги	
☎️ Телефон номери: 53-512

🔰 32-сонли Оқрабод туман контакт тармоғи	
☎️ Телефон номери: 53-425, 95 325-25-95

🔰 32-сонли Оқрабод тортув нимстанцияси	
☎️ Телефон номери: 53-423; 30-250; 30-252


""",
"Қарши-Мароқанд темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари":"""
🔰 4122 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-401; 58-690

🔰 3860 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-522

🔰 3857 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-521

🔰 3834 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-450; 58-535

🔰 3822 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-582; 58-402

🔰 3812 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-702; 58-381

🔰 3804 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-293 58-400

🔰 3766 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-107  58-140

🔰 3753 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-082

🔰 3746 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-081

🔰 3741 км йўл кесишма навбатчиси
☎️ Телефон номери: 58-080


""",
"Қарши-Китоб темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари":"""
🔰 3 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-730; 58-731

🔰 10 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-819

🔰 14 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-818

🔰 19 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-817

🔰 30 км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-816

🔰 42 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-208

🔰 48 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-209

🔰 53 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-207

🔰 77 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-239

🔰 101 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-269

🔰 107 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-299

🔰 111 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-327

🔰 115 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-328

🔰 121 км йўл кесишма навбатчиси	
☎️ Телефон номери: 63-329


""",
"Қарши-Рзд.154 темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари":"""
🔰 4130  км йўл кесишма навбатчиси	
☎️ Телефон номери: 58-733  58-734
""",
"Тошғузор-Қайирма темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари":"""
🔰 1 км йўл кесишма навбатчиси	
☎️ Телефон номери: 69-626
""",
"Бошқа ташкилотлар":"""
🔰 Жисмоний спорт ишлари бўйича директори	
☎️ Телефон номери: 55-488

🔰 Қарши суғурта компанияси	
☎️ Телефон номери: 55-154

🔰 Темир йўлчилар маданият саройи	
☎️ Телефон номери: 55-152

🔰 Насос станцияси	
☎️ Телефон номери: 55-537


""",
"“Ўзбекистон темир йўллари” АЖ  таркибидаги телефон операторларининг рақамлари":"""
🔰 “Тошкент МТУ”	
☎️ Телефон номери: 49-121   48-121

🔰 “Термиз МТУ” УК 	
☎️ Телефон номери: 51-121

🔰 “Қарши МТУ” УК 	
☎️ Телефон номери: 55-121

🔰 “Бухоро МТУ” УК	
☎️ Телефон номери: 60-121

🔰 “Қунғирот МТУ” УК	
☎️ Телефон номери: 50-613   60-621

🔰 “Қўқон МТУ” УК	
☎️ Телефон номери: 67-121

🔰 Самарқанд темир йўллари	
☎️ Телефон номери: 24-121

🔰 Сирдарё темир йўллари	
☎️ Телефон номери: 22-121   21-121

🔰 Тинчлик темир йўллари	
☎️ Телефон номери: 65-121


""",
}
        for i,j in dict_contac.items():
            if i == data.get('name'):
                await message.answer(f"<b>🔰 {i}</b> \n\n<b>{j}</b>", parse_mode="HTML", reply_markup=bosh_sahifa) 
                      
        await state.reset_state(with_data=True)




if __name__ == '__main__':
    executor.start_polling(dp, skip_updates=True)