from aiogram.types import ReplyKeyboardMarkup,KeyboardButton,InlineKeyboardButton,InlineKeyboardMarkup


bosh_sahifa = ReplyKeyboardMarkup(
	keyboard = [
		[
				KeyboardButton(text="📝 Malumotlar"),KeyboardButton(text="🔎 Qidiruv")
		],

	],
	resize_keyboard = True
)

bosh_sahifa_qarshi_uzel = ReplyKeyboardMarkup(
	keyboard = [
		[
				KeyboardButton(text=""""Qarshi mintaqaviy temir yo'l uzeli" UK""")
		],

	],
	resize_keyboard = True
)

bosh_sahifa_qarshi_bolimlar_0 = ReplyKeyboardMarkup(
	keyboard = [
		[
				KeyboardButton(text="Корхоналар"), KeyboardButton(text="МТУ бўлимлар")
		],
		[
				KeyboardButton(text="Худудий бўлинмалар"), KeyboardButton(text="Станциялар")
		],
		[
				KeyboardButton(text="⏹ Бош саҳифа")
		],

	],
	resize_keyboard = True
)



bosh_sahifa_qarshi_bolimlar_1 = ReplyKeyboardMarkup(
	keyboard = [
		[
				KeyboardButton(text="⏹ Бош саҳифа"), KeyboardButton(text="⬅️ orqaga")
		],
		[
				KeyboardButton(text="МТУ-5 бошлиғи , бош муҳандис ва ёрдамчилари")
		],
		[
				KeyboardButton(text="Ходимлар ва ижтимоий масалалар бўлими")
		],
		[
				KeyboardButton(text="МТУ-5 навбатчи бўлими (ДНЦО)")
		],
		[
				KeyboardButton(text="Статистика ва ҳисобот бўлими")
		],
		[
				KeyboardButton(text="Молия бўлими")
		],
		[
				KeyboardButton(text="Ҳисобчилар бўлими")
		],
		[
				KeyboardButton(text="Иқтисодий таҳлил ва прогнозлаш бўлими")
		],
		[
				KeyboardButton(text="Ҳаридлар бўлими")
		],
		[
				KeyboardButton(text="Махсус бўлим")
		],
		[
				KeyboardButton(text="АКТ ва АХ бўлими")
		],
		[
				KeyboardButton(text="Капитал қурилиш бўлими")
		],
		[
				KeyboardButton(text="Юк ва тижорат ишлари бўлими")
		],
		[
				KeyboardButton(text="Технологик ҳужжатларни қайта ишлаш маркази 'Тех ПД-5'")
		],
		[
				KeyboardButton(text="“Қарши МТУ” УК 'Ўзгосжеллдорнадзор' ҳудудий инспектсияси")
		],
		[
				KeyboardButton(text="Техник ишлаб чиқариш бўлими")
		],
		[
				KeyboardButton(text="Қарши алоқа ва ишорат муассасаси ШЧ-8")
		],


	],
	resize_keyboard = True
)

bosh_sahifa_qarshi_bolimlar_2 = ReplyKeyboardMarkup(
	keyboard = [
		[
				KeyboardButton(text="⏹ Бош саҳифа"), KeyboardButton(text="⬅️ orqaga")
		],
		[
				KeyboardButton(text="Қарши электр таъминоти корхонаси (ЭЧ-5)")
		],
		[
				KeyboardButton(text="Қарши темир йул таъмирлаш корхонаси (ПЧ-12)")
		],
		[
				KeyboardButton(text="Қашқадарё темир йул таъмирлаш корхонаси (ПЧ-14)")
		],
		[
				KeyboardButton(text="Қарши вагон депоси (ВЧД-8)")
		],
		[
				KeyboardButton(text="Қарши локомотив депоси (ТЧ-8)")
		],
		[
				KeyboardButton(text="Қарши қурилиш таъмирлаш корхонаси")
		],
		[
				KeyboardButton(text="“Қорабайир” отчилик мажмуаси")
		],
		[
				KeyboardButton(text="Қарши бекати (ДС)")
		],

	],
	resize_keyboard = True
)

bosh_sahifa_qarshi_bolimlar_3 = ReplyKeyboardMarkup(
	keyboard = [
		[
				KeyboardButton(text="⏹ Бош саҳифа"), KeyboardButton(text="⬅️ orqaga")
		],
		[
				KeyboardButton(text="Қарши Транспорт прокуратураси")
		],
		[
				KeyboardButton(text="Қашқадарё вилояти Давлат хавфсизлик хизмати")
		],
		[
				KeyboardButton(text="Транспортда Хафсизликни Таъминлаш Бошқармаси")
		],
		[
				KeyboardButton(text="Қарши темир йўл бекати шахобчаси ва аэрапортларда харбий ҳаракатлар бўлими")
		],
		[
				KeyboardButton(text="Қарши ҳарбийлаштирилган қўриқлаш отряди штаби ва отряд таркибидаги командалар")
		],
				[
				KeyboardButton(text="Қарши ўкчилик ўт ўчириш командаси")
		],
		[
				KeyboardButton(text="Қарши 4301-сонли  тиклаш поезди")
		],
		[
				KeyboardButton(text="“Ўзтемирйўлйўловчи” АЖ “Қашқадарё филиали")
		],
		[
				KeyboardButton(text="“Ўзтемирйўлконтейнер” АЖ “Қарши МТУ” УК бўлими")
		],
		[
				KeyboardButton(text="Қарши “Темирйўлёнилғитаъмин” бошқармаси")
		],
		[
				KeyboardButton(text="Қарши тармоқ санитария эпидемиология маркази (СЭС)")
		],
		[
				KeyboardButton(text="Қарши темир йўл шифохонаси")
		],
		[
				KeyboardButton(text="“Қарши МТУ” УК Касаба уюшмасининг ҳудудий қўмитаси")
		],


	],
	resize_keyboard = True
)

bosh_sahifa_qarshi_bolimlar_4 = ReplyKeyboardMarkup(
	keyboard = [
		[
				KeyboardButton(text="⏹ Бош саҳифа"), KeyboardButton(text="⬅️ orqaga")
		],
		[
				KeyboardButton(text="Қарши-Мароқанд темир йўл участкаси бекати телефон рақамлари")
		],
		[
				KeyboardButton(text="Қарши-Китоб темир йўл участкаси бекати телефон рақамлари")
		],
		[
				KeyboardButton(text="Тошғузор-Оқработ темир йўл участкаси бекати телефон рақамлари")
		],
		[
				KeyboardButton(text="Қарши-Мароқанд темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари")
		],
		[
				KeyboardButton(text="Қарши-Китоб темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари")
		],
				[
				KeyboardButton(text="Қарши-Рзд.154 темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари")
		],
		[
				KeyboardButton(text="Тошғузор-Қайирма темир йўл участкасидаги қўриқланадиган темир йўл кесишма телефон рақамлари")
		],


	],
	resize_keyboard = True
)











